mechacoredev/stm32f4-freertos-multi-device-hub/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "bme280.h"
#include "rc522.h"
#include "nrf24l01.h"
#include "mpu6050.h"
#include "ili9341.h"
#include "system_health.h"
#include "string.h"
#include "can_manager.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

typedef struct{
  bool active;
  uint32_t start_tick;
  i2c_job_t job;
}i2c_dispatch_slot_t;

typedef struct{
  bool active;
  uint32_t start_tick;
  spi_job_t job;
}spi_dispatch_slot_t;

typedef struct{
  float temperature_c;
  float humidity_percent;
  float pressure_pa;
  bool valid;
  uint32_t update_count;
}bme280_display_data_t;

typedef struct{
  float accel_g[3];
  float gyro_dps[3];
  bool valid;
  uint32_t update_count;
}mpu6050_display_data_t;

typedef struct{
  char tx_text[NRF24L01_PAYLOAD_SIZE + 1];
  char rx_text[NRF24L01_PAYLOAD_SIZE + 1];
  uint8_t tx_length;
  uint8_t rx_length;
  bool tx_valid;
  bool rx_valid;
  uint32_t tx_update_count;
  uint32_t rx_update_count;
}nrf24l01_display_data_t;

typedef struct{
  bool card_found;
  char block_text[17];
  uint32_t update_count;
}rc522_display_data_t;

typedef struct{
  uint32_t scl_level;
  uint32_t sda_level;
  uint32_t sr1;
  uint32_t sr2;
  uint32_t cr1;
  uint32_t cr2;
  uint32_t queue_depth;
  uint32_t dma_active_count;
  uint32_t busy_requeue_count;
  uint32_t runtime_recovery_count;
  uint32_t runtime_recovery_success_count;
  uint32_t transaction_count;
  uint32_t completed_count;
  uint32_t timeout_count;
  uint32_t hardware_error_count;
  uint32_t stop_wait_timeout_count;
  uint32_t software_reset_count;
  uint32_t physical_recovery_count;
  uint32_t physical_recovery_success_count;
  uint32_t recovery_failed_count;
  uint8_t device_address;
  uint8_t register_address;
  i2c_manager_phase_t phase;
  i2c_manager_phase_t last_error_phase;
  i2c_manager_return_status last_result;
  bool bus_free_after_cleanup;
}runtime_i2c_debug_t;

typedef struct{
  uint32_t snapshot_tick;
  runtime_i2c_debug_t i2c1;
  uint32_t bme280_update_count;
  uint32_t bme280_data_age_ms;
  uint32_t mpu6050_update_count;
  uint32_t mpu6050_data_age_ms;
  uint32_t mpu6050_dma_success_count;
  uint32_t mpu6050_dma_error_count;
  uint32_t mpu6050_queue_error_count;
  uint32_t rc522_liveness_age_ms;
  uint32_t rc522_liveness_error_count;
  uint8_t rc522_expected_version;
  uint8_t rc522_last_observed_version;
  uint32_t nrf_tx_success_age_ms;
  uint32_t nrf_tx_success_count;
  uint32_t nrf_tx_error_count;
  uint32_t nrf_rx_success_age_ms;
  uint32_t nrf_rx_packet_count;
  uint32_t ili9341_success_age_ms;
  uint32_t ili9341_dma_success_count;
  uint32_t ili9341_dma_error_count;
  uint32_t stale_sensor_mask;
  uint32_t stale_subsystem_mask;
  bool sensor_data_fresh;
  bool all_monitored_subsystems_healthy;
  uint32_t heartbeat_mask;
  uint32_t missing_heartbeat_mask;
  uint32_t monitor_cycle_count;
  uint32_t reset_cause;
  uint32_t watchdog_feed_count;
  uint32_t watchdog_start_failure_count;
  bool last_reset_was_watchdog;
  bool watchdog_active;
  bool startup_grace_active;
  bool normal_monitoring_started;
  bool watchdog_feed_allowed;
  bool bme280_initialized;
  bool mpu6050_initialized;
  bool rc522_initialized;
  bool nrf_tx_initialized;
  bool nrf_rx_initialized;
  bool ili9341_initialized;
}runtime_debug_t;

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

#define DMA_DISPATCH_TIMEOUT_MS 1000

#define I2C_DMA_NEW_JOB_FLAG  0x01
#define I2C1_DMA_DONE_FLAG    0x02
#define I2C2_DMA_DONE_FLAG    0x04
#define I2C3_DMA_DONE_FLAG    0x08
#define I2C_DMA_ALL_FLAGS     0x0F
#define I2C_WORKER_READY_FLAG  0x10
#define I2C_RUNTIME_READY_FLAG 0x20

#define SPI_DMA_NEW_JOB_FLAG  0x01
#define SPI1_DMA_DONE_FLAG    0x02
#define SPI2_DMA_DONE_FLAG    0x04
#define SPI3_DMA_DONE_FLAG    0x08
#define SPI_DMA_ALL_FLAGS     0x0F

#define ILI9341_DMA_SUCCESS_FLAG 0x01
#define ILI9341_DMA_ERROR_FLAG   0x02
#define ILI9341_DMA_ALL_FLAGS    0x03

#define BME280_DMA_SUCCESS_FLAG  0x01
#define BME280_DMA_ERROR_FLAG    0x02
#define BME280_DMA_ALL_FLAGS     0x03
#define MPU6050_DATA_READY_FLAG  0x01
#define MPU6050_DMA_SUCCESS_FLAG 0x02
#define MPU6050_DMA_ERROR_FLAG   0x04
#define MPU6050_ALL_FLAGS        0x07

#define MPU6050_USE_DATA_READY_INTERRUPT 1
#define I2C_SENSOR_CLIENT_COUNT 2
#define I2C_SENSOR_ERROR_BACKOFF_MS 50
#define SENSOR_DATA_STALE_TIMEOUT_MS 2000
#define RC522_LIVENESS_CHECK_PERIOD_MS 1000
#define RC522_LIVENESS_STALE_TIMEOUT_MS 3000
#define NRF_PROGRESS_STALE_TIMEOUT_MS 4000
#define DISPLAY_PROGRESS_STALE_TIMEOUT_MS 2000
#define WATCHDOG_STARTUP_GRACE_MS 5000
#define BUS_RECOVERY_RETRY_PERIOD_MS 1000
#define BUS_RECOVERY_RESET_TIMEOUT_MS 30000
#define CAN_ACK_TIMEOUT_MS 3000
#define SENSOR_STALE_BME280_MASK 0x01
#define SENSOR_STALE_MPU6050_MASK 0x02
#define SPI_STALE_RC522_MASK 0x04
#define SPI_STALE_NRF_TX_MASK 0x08
#define SPI_STALE_NRF_RX_MASK 0x10
#define SPI_STALE_DISPLAY_MASK 0x20

/* 0: tum cihazlar aktif, 1: yalnizca I2C1 uzerindeki BME280/MPU6500 ve CAN2. */
#define REDUCED_I2C_CAN_TEST 0

#if REDUCED_I2C_CAN_TEST
#define ACTIVE_HEALTH_MASK \
  (SYSTEM_HEALTH_TASK_MASK(HEALTH_TASK_BME280) | \
   SYSTEM_HEALTH_TASK_MASK(HEALTH_TASK_MPU6050) | \
   SYSTEM_HEALTH_TASK_MASK(HEALTH_TASK_I2C_DISPATCH) | \
   SYSTEM_HEALTH_TASK_MASK(HEALTH_TASK_CAN_RX) | \
   SYSTEM_HEALTH_TASK_MASK(HEALTH_TASK_CAN_TX))
#else
#define ACTIVE_HEALTH_MASK \
  (SYSTEM_HEALTH_TASK_MASK(HEALTH_TASK_BME280) | \
   SYSTEM_HEALTH_TASK_MASK(HEALTH_TASK_MPU6050) | \
   SYSTEM_HEALTH_TASK_MASK(HEALTH_TASK_I2C_DISPATCH) | \
   SYSTEM_HEALTH_TASK_MASK(HEALTH_TASK_RC522) | \
   SYSTEM_HEALTH_TASK_MASK(HEALTH_TASK_SPI_DISPATCH) | \
   SYSTEM_HEALTH_TASK_MASK(HEALTH_TASK_NRF_TX) | \
   SYSTEM_HEALTH_TASK_MASK(HEALTH_TASK_NRF_RX) | \
   SYSTEM_HEALTH_TASK_MASK(HEALTH_TASK_DISPLAY) | \
   SYSTEM_HEALTH_TASK_MASK(HEALTH_TASK_CAN_RX) | \
   SYSTEM_HEALTH_TASK_MASK(HEALTH_TASK_CAN_TX))
#endif

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
CAN_HandleTypeDef hcan2;

/* Definitions for bme280task */
osThreadId_t bme280taskHandle;
const osThreadAttr_t bme280task_attributes = {
  .name = "bme280task",
  .stack_size = 512 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};
/* Definitions for i2cdmatask */
osThreadId_t i2cdmataskHandle;
const osThreadAttr_t i2cdmatask_attributes = {
  .name = "i2cdmatask",
  .stack_size = 512 * 4,
  .priority = (osPriority_t) osPriorityAboveNormal,
};
