mechacoredev/stm32f4-freertos-multi-device-hub/Core/Src/main.c
/* Definitions for rc522task */
osThreadId_t rc522taskHandle;
const osThreadAttr_t rc522task_attributes = {
  .name = "rc522task",
  .stack_size = 256 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};
/* Definitions for mpu6050task */
osThreadId_t mpu6050taskHandle;
const osThreadAttr_t mpu6050task_attributes = {
  .name = "mpu6050task",
  .stack_size = 512 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};
/* Definitions for spidmatask */
osThreadId_t spidmataskHandle;
const osThreadAttr_t spidmatask_attributes = {
  .name = "spidmatask",
  .stack_size = 192 * 4,
  .priority = (osPriority_t) osPriorityAboveNormal,
};
/* Definitions for nrf24l01TXtask */
osThreadId_t nrf24l01TXtaskHandle;
const osThreadAttr_t nrf24l01TXtask_attributes = {
  .name = "nrf24l01TXtask",
  .stack_size = 192 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};
/* Definitions for nrf24l01RXtask */
osThreadId_t nrf24l01RXtaskHandle;
const osThreadAttr_t nrf24l01RXtask_attributes = {
  .name = "nrf24l01RXtask",
  .stack_size = 192 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};
/* Definitions for ili9341task */
osThreadId_t ili9341taskHandle;
const osThreadAttr_t ili9341task_attributes = {
  .name = "ili9341task",
  .stack_size = 512 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};
/* Definitions for healthtask */
osThreadId_t healthtaskHandle;
const osThreadAttr_t healthtask_attributes = {
  .name = "healthtask",
  .stack_size = 256 * 4,
  .priority = (osPriority_t) osPriorityHigh,
};
/* Definitions for CAN2ReadTask */
osThreadId_t CAN2ReadTaskHandle;
const osThreadAttr_t CAN2ReadTask_attributes = {
  .name = "CAN2ReadTask",
  .stack_size = 512 * 4,
  .priority = (osPriority_t) osPriorityAboveNormal,
};
/* Definitions for CAN2WriteTask */
osThreadId_t CAN2WriteTaskHandle;
const osThreadAttr_t CAN2WriteTask_attributes = {
  .name = "CAN2WriteTask",
  .stack_size = 256 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};
/* Definitions for i2c_job_queue */
osMessageQueueId_t i2c_job_queueHandle;
const osMessageQueueAttr_t i2c_job_queue_attributes = {
  .name = "i2c_job_queue"
};
/* Definitions for spi_job_queue */
osMessageQueueId_t spi_job_queueHandle;
const osMessageQueueAttr_t spi_job_queue_attributes = {
  .name = "spi_job_queue"
};
/* Definitions for i2c_mutex */
osMutexId_t i2c_mutexHandle;
const osMutexAttr_t i2c_mutex_attributes = {
  .name = "i2c_mutex"
};
/* Definitions for i2c_init_mutex */
osMutexId_t i2c_init_mutexHandle;
const osMutexAttr_t i2c_init_mutex_attributes = {
  .name = "i2c_init_mutex"
};
/* Definitions for spi_mutex */
osMutexId_t spi_mutexHandle;
const osMutexAttr_t spi_mutex_attributes = {
  .name = "spi_mutex"
};
/* Definitions for spi3_mutex */
osMutexId_t spi3_mutexHandle;
const osMutexAttr_t spi3_mutex_attributes = {
  .name = "spi3_mutex"
};
/* Definitions for spi2_mutex */
osMutexId_t spi2_mutexHandle;
const osMutexAttr_t spi2_mutex_attributes = {
  .name = "spi2_mutex"
};
/* Definitions for sensor_data_mutex */
osMutexId_t sensor_data_mutexHandle;
const osMutexAttr_t sensor_data_mutex_attributes = {
  .name = "sensor_data_mutex"
};
/* Definitions for dma_semaphore */
osSemaphoreId_t dma_semaphoreHandle;
const osSemaphoreAttr_t dma_semaphore_attributes = {
  .name = "dma_semaphore"
};
/* Definitions for spi_semaphore */
osSemaphoreId_t spi_semaphoreHandle;
const osSemaphoreAttr_t spi_semaphore_attributes = {
  .name = "spi_semaphore"
};
/* Definitions for spi3_semaphore */
osSemaphoreId_t spi3_semaphoreHandle;
const osSemaphoreAttr_t spi3_semaphore_attributes = {
  .name = "spi3_semaphore"
};
/* Definitions for spi2_semaphore */
osSemaphoreId_t spi2_semaphoreHandle;
const osSemaphoreAttr_t spi2_semaphore_attributes = {
  .name = "spi2_semaphore"
};
/* USER CODE BEGIN PV */
bme280_handle_t my_bme280 = NULL;
rc522_handle_t my_rc522 = NULL;
mpu6050_handle_t my_mpu6050 = NULL;
nrf24l01_handle_t my_nrf2401 = NULL;
uint8_t sayac=0;
nrf24l01_handle_t my_nrf_tx = NULL;
nrf24l01_handle_t my_nrf_rx = NULL;
volatile uint32_t nrf_tx_success_count = 0;
volatile uint32_t nrf_tx_error_count = 0;
volatile uint32_t nrf_rx_packet_count = 0;
volatile uint8_t nrf_rx_fifo_count = 0;
volatile uint8_t nrf_rx_debug_write_index = 0;
volatile bool nrf_rx_fifo_was_full = false;
uint8_t nrf_rx_fifo[NRF24L01_FIFO_DEPTH][NRF24L01_PAYLOAD_SIZE] = {0};
uint8_t nrf_rx_payload_lengths[NRF24L01_FIFO_DEPTH] = {0};
volatile uint8_t i2c_dma_active_count = 0;
volatile uint8_t i2c_dma_max_concurrent = 0;
volatile bool i2c1_startup_recovery_completed = false;
volatile bool i2c1_startup_recovery_success = false;
volatile bool i2c1_startup_was_busy = false;
volatile bool i2c1_startup_sda_was_low = false;
volatile uint32_t i2c1_startup_recovery_count = 0;
volatile uint32_t i2c1_startup_clock_pulse_count = 0;
volatile uint32_t i2c1_startup_sr2_before = 0;
volatile uint32_t i2c1_startup_sr2_after = 0;
volatile uint32_t i2c1_runtime_recovery_count = 0;
volatile uint32_t i2c1_runtime_recovery_success_count = 0;
volatile uint32_t i2c1_runtime_recovery_clock_pulse_count = 0;
volatile uint32_t i2c1_runtime_recovery_sr2_before = 0;
volatile uint32_t i2c1_runtime_recovery_sr2_after = 0;
volatile uint32_t i2c1_runtime_busy_requeue_count = 0;
volatile uint32_t i2c_init_mutex_acquire_count = 0;
volatile uint32_t i2c_init_mutex_release_count = 0;
const char* volatile i2c_init_mutex_owner_name = NULL;
volatile bool i2c_runtime_ready = false;
volatile uint32_t i2c_sensor_client_ready_count = 0;
volatile uint32_t i2c_runtime_start_count = 0;
volatile uint32_t i2c_polling_job_count = 0;
volatile uint32_t i2c_dma_job_count = 0;
volatile i2c_manager_return_status i2c_last_polling_job_status =
        _i2c_manager_ok;
volatile uint8_t spi_dma_active_count = 0;
volatile uint8_t spi_dma_max_concurrent = 0;
ili9341_handle_t my_tft1 = NULL;
ili9341_handle_t my_tft2 = NULL;
volatile bool ili9341_init_completed = false;
volatile bool ili9341_test_passed = false;
volatile uint32_t ili9341_dma_success_count = 0;
volatile uint32_t ili9341_dma_error_count = 0;
volatile ili9341_return_status ili9341_last_status = _ili9341_ok;
bme280_display_data_t bme280_display_data = {0};
mpu6050_display_data_t mpu6050_display_data = {0};
nrf24l01_display_data_t nrf24l01_display_data = {0};
rc522_display_data_t rc522_display_data = {0};
volatile bool bme280_init_completed = false;
volatile bool mpu6050_init_completed = false;
volatile uint32_t mpu6050_dma_success_count = 0;
volatile uint32_t mpu6050_dma_error_count = 0;
volatile uint32_t mpu6050_queue_error_count = 0;
volatile uint32_t mpu6050_irq_level_recovery_count = 0;
volatile bool mpu6050_startup_int_clear_success = false;
volatile bool mpu6050_startup_int_was_data_ready = false;
volatile uint32_t bme280_last_success_tick = 0;
volatile uint32_t mpu6050_last_success_tick = 0;
volatile uint32_t rc522_last_liveness_tick = 0;
volatile uint32_t rc522_liveness_error_count = 0;
volatile uint8_t rc522_last_observed_version = 0;
volatile uint32_t nrf_tx_last_success_tick = 0;
volatile uint32_t nrf_rx_last_success_tick = 0;
volatile uint32_t ili9341_last_success_tick = 0;
volatile uint32_t sensor_data_stale_mask = 0;
volatile uint32_t subsystem_stale_mask = 0;
volatile bool health_startup_grace_active = true;
volatile bool health_normal_monitoring_started = false;
volatile bool health_watchdog_feed_allowed = false;
volatile runtime_debug_t g_runtime_debug = {0};
volatile bool rc522_init_completed = false;
volatile uint8_t rc522_version = 0;
volatile uint8_t rc522_last_request_status = MI_NOTAGERR;
volatile uint8_t rc522_last_anticoll_status = MI_NOTAGERR;
volatile uint8_t rc522_last_uid[5] = {0};
volatile uint32_t rc522_detection_count = 0;
volatile bool spi_dispatch_ready = false;
volatile bool nrf_tx_init_completed = false;
volatile bool nrf_rx_init_completed = false;
/* USER CODE END PV */

