mechacoredev/stm32f4-freertos-multi-device-hub/Core/Src/main.c
/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_I2C1_Init(void);
static void MX_SPI1_Init(void);
static void MX_SPI3_Init(void);
static void MX_CAN2_Init(void);
void startbme280task(void *argument);
void starti2cdmatask(void *argument);
void startrc522task(void *argument);
void startmpu6050task(void *argument);
void startspidmatask(void *argument);
void startnrf24l01TXtask(void *argument);
void startnrf24l01RXtask(void *argument);
void startili9341task(void *argument);
void starthealthtask(void *argument);
void StartCAN2ReadTask(void *argument);
void StartCAN2WriteTask(void *argument);

/* USER CODE BEGIN PFP */

static int8_t get_i2c_dispatch_index(I2C_TypeDef* i2c_handle);
static bool recover_i2c1_bus_once(void);
static int8_t get_spi_dispatch_index(SPI_TypeDef* spi_handle);
static osStatus_t submit_i2c_dma_job(i2c_job_t* job);
static osStatus_t submit_spi_dma_job(spi_job_t* job);
static ili9341_return_status run_ili9341_dma_operation(
        ili9341_handle_t display);
static ili9341_return_status draw_ili9341_text(ili9341_handle_t display,
        uint16_t x, uint16_t y, const char* text);
static ili9341_return_status draw_ili9341_colored_text(
        ili9341_handle_t display, uint16_t x, uint16_t y, const char* text,
        uint16_t color);
static ili9341_return_status draw_sensor_display_layout(void);
static ili9341_return_status refresh_bme280_display(
        const bme280_display_data_t* data);
static ili9341_return_status refresh_mpu6050_display(
        const mpu6050_display_data_t* data);
static ili9341_return_status refresh_nrf_tx_display(
        const nrf24l01_display_data_t* data);
static ili9341_return_status refresh_nrf_rx_display(
        const nrf24l01_display_data_t* data);
static ili9341_return_status refresh_rc522_display(
        const rc522_display_data_t* data);
static void format_fixed_2(char* output, uint8_t field_width,
        float value, const char* unit);
static void format_text_field(char* output, uint8_t field_width,
        const char* text);
static void copy_display_text(char* output, uint8_t output_size,
        const uint8_t* input, uint8_t input_length);
static void refresh_i2c_dma_debug(i2c_dispatch_slot_t* active_jobs);
static void refresh_spi_dma_debug(spi_dispatch_slot_t* active_jobs);
static void refresh_runtime_debug(uint32_t now,
        uint32_t stale_sensor_mask);
static bool validate_rc522_spi(void* context);
static bool validate_nrf24_spi(void* context);

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

static bool validate_rc522_spi(void* context){
  rc522_handle_t device = (rc522_handle_t)context;
  if(device == NULL) return false;

  uint8_t version = rc522_get_version(device);
  return (version != 0) && (version != 0xFF);
}

static bool validate_nrf24_spi(void* context){
  return nrf24l01_validate((nrf24l01_handle_t)context);
}

static int8_t get_i2c_dispatch_index(I2C_TypeDef* i2c_handle){
  if(i2c_handle == I2C1) return 0;
  if(i2c_handle == I2C2) return 1;
  if(i2c_handle == I2C3) return 2;
  return -1;
}

static void startup_delay_us(uint32_t delay_us){
  CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
  DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;
  uint32_t cycles_per_us = SystemCoreClock / 1000000;
  if(cycles_per_us == 0) cycles_per_us = 1;
  uint32_t start_cycle = DWT->CYCCNT;
  uint32_t delay_cycles = cycles_per_us * delay_us;
  while((DWT->CYCCNT - start_cycle) < delay_cycles) { }
}

static bool wait_i2c1_line_high(uint32_t pin, uint32_t timeout_us){
  uint32_t elapsed_us = 0;
  while(LL_GPIO_IsInputPinSet(GPIOB, pin) == 0){
    if(elapsed_us >= timeout_us) return false;
    startup_delay_us(10);
    elapsed_us += 10;
  }
  return true;
}

static bool recover_i2c1_bus_lines(volatile uint32_t* pulse_count,
        volatile bool* was_busy, volatile bool* sda_was_low){
  const uint32_t i2c1_pins = LL_GPIO_PIN_6 | LL_GPIO_PIN_7;
  const uint32_t scl_pin = LL_GPIO_PIN_6;
  const uint32_t sda_pin = LL_GPIO_PIN_7;
  LL_GPIO_InitTypeDef gpio = {0};

  LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOB);
  LL_APB1_GRP1_ForceReset(LL_APB1_GRP1_PERIPH_I2C1);
  LL_APB1_GRP1_ReleaseReset(LL_APB1_GRP1_PERIPH_I2C1);

  // ODR bitlerini once HIGH yapmak, AF'den GPIO'ya gecerken LOW darbesini onler.
  LL_GPIO_SetOutputPin(GPIOB, i2c1_pins);
  gpio.Pin = i2c1_pins;
  gpio.Mode = LL_GPIO_MODE_OUTPUT;
  gpio.Speed = LL_GPIO_SPEED_FREQ_HIGH;
  gpio.OutputType = LL_GPIO_OUTPUT_OPENDRAIN;
  gpio.Pull = LL_GPIO_PULL_UP;
  LL_GPIO_Init(GPIOB, &gpio);
  startup_delay_us(20);

  bool scl_was_low = LL_GPIO_IsInputPinSet(GPIOB, scl_pin) == 0;
  bool current_sda_low = LL_GPIO_IsInputPinSet(GPIOB, sda_pin) == 0;
  if(sda_was_low != NULL) *sda_was_low = current_sda_low;
  if(was_busy != NULL) *was_busy = scl_was_low || current_sda_low;

  // Slave bir baytin ortasinda kaldiysa en fazla dokuz clock ile bayti bitirt.
  for(uint32_t pulse = 0;
      pulse < 9 && LL_GPIO_IsInputPinSet(GPIOB, sda_pin) == 0;
      pulse++){
    LL_GPIO_ResetOutputPin(GPIOB, scl_pin);
    startup_delay_us(10);
    LL_GPIO_SetOutputPin(GPIOB, scl_pin);
    wait_i2c1_line_high(scl_pin, 1000);
    startup_delay_us(10);
    if(pulse_count != NULL) (*pulse_count)++;
  }

  // Belirgin bir STOP olustur: SDA LOW, SCL HIGH, sonra SDA HIGH.
  LL_GPIO_ResetOutputPin(GPIOB, sda_pin);
  startup_delay_us(10);
  LL_GPIO_SetOutputPin(GPIOB, scl_pin);
  bool scl_released = wait_i2c1_line_high(scl_pin, 1000);
  startup_delay_us(10);
  LL_GPIO_SetOutputPin(GPIOB, sda_pin);
  startup_delay_us(10);

  bool sda_released = LL_GPIO_IsInputPinSet(GPIOB, sda_pin) != 0;
  return scl_released && sda_released;
}

static bool recover_i2c1_bus_once(void){
  i2c1_startup_recovery_count++;
  i2c1_startup_sr2_before = I2C1->SR2;
  return recover_i2c1_bus_lines(&i2c1_startup_clock_pulse_count,
          &i2c1_startup_was_busy, &i2c1_startup_sda_was_low);
}

