mechacoredev/stm32f4-freertos-multi-device-hub/Core/Src/main.c
static bool recover_i2c1_bus_runtime(I2C_TypeDef* i2c){
  if(i2c != I2C1) return false;

  i2c1_runtime_recovery_count++;
  i2c1_runtime_recovery_sr2_before = I2C1->SR2;
  bool lines_released = recover_i2c1_bus_lines(
          &i2c1_runtime_recovery_clock_pulse_count, NULL, NULL);

  /* GPIO pinlerini tekrar AF4 open-drain yapar ve I2C1 registerlarini
   * CubeMX'teki 400 kHz ayarlariyla yeniden kurar. */
  MX_I2C1_Init();
  i2c1_runtime_recovery_sr2_after = I2C1->SR2;

  bool recovered = lines_released &&
          (i2c1_runtime_recovery_sr2_after & I2C_SR2_BUSY) == 0;
  if(recovered) i2c1_runtime_recovery_success_count++;
  return recovered;
}

static int8_t get_spi_dispatch_index(SPI_TypeDef* spi_handle){
  if(spi_handle == SPI1) return 0;
  if(spi_handle == SPI2) return 1;
  if(spi_handle == SPI3) return 2;
  return -1;
}

static osStatus_t submit_i2c_dma_job(i2c_job_t* job){
  if(job == NULL) return osErrorParameter;
  if(job->i2c_handle == I2C1 && i2c_runtime_ready == false){
    return osErrorResource;
  }

  osStatus_t queue_status;
  queue_status = osMessageQueuePut(i2c_job_queueHandle, job, 0, 0);
  if(queue_status == osOK && i2cdmataskHandle != NULL){
    osThreadFlagsSet(i2cdmataskHandle, I2C_DMA_NEW_JOB_FLAG);
  }
  return queue_status;
}

static void complete_i2c_job(i2c_job_t* job,
        i2c_manager_return_status result){
  if(job == NULL) return;
  if(job->completion_result != NULL){
    *job->completion_result = result;
  }

  uint32_t result_flag = result == _i2c_manager_ok ?
          job->notify_flag : job->error_flag;
  if(job->notify_task != NULL && result_flag != 0){
    osThreadFlagsSet(job->notify_task, result_flag);
  }
}

static bool requeue_i2c_job(i2c_job_t* job){
  if(job == NULL) return false;
  if(osMessageQueuePut(i2c_job_queueHandle, job, 0, 0) == osOK){
    return true;
  }
  complete_i2c_job(job, _i2c_manager_busy);
  return false;
}

static void refresh_runtime_debug(uint32_t now,
        uint32_t stale_mask){
  volatile i2c_manager_diagnostics_t* manager =
          &g_i2c_manager_diagnostics[0];

  g_runtime_debug.snapshot_tick = now;
  g_runtime_debug.i2c1.scl_level =
          LL_GPIO_IsInputPinSet(GPIOB, LL_GPIO_PIN_6) != 0;
  g_runtime_debug.i2c1.sda_level =
          LL_GPIO_IsInputPinSet(GPIOB, LL_GPIO_PIN_7) != 0;
  g_runtime_debug.i2c1.sr1 = I2C1->SR1;
  g_runtime_debug.i2c1.sr2 = I2C1->SR2;
  g_runtime_debug.i2c1.cr1 = I2C1->CR1;
  g_runtime_debug.i2c1.cr2 = I2C1->CR2;
  if(i2c_job_queueHandle == NULL){
    g_runtime_debug.i2c1.queue_depth = 0;
  }else{
    g_runtime_debug.i2c1.queue_depth =
            osMessageQueueGetCount(i2c_job_queueHandle);
  }
  g_runtime_debug.i2c1.dma_active_count = i2c_dma_active_count;
  g_runtime_debug.i2c1.busy_requeue_count =
          i2c1_runtime_busy_requeue_count;
  g_runtime_debug.i2c1.runtime_recovery_count =
          i2c1_runtime_recovery_count;
  g_runtime_debug.i2c1.runtime_recovery_success_count =
          i2c1_runtime_recovery_success_count;
  g_runtime_debug.i2c1.transaction_count = manager->transaction_count;
  g_runtime_debug.i2c1.completed_count = manager->completed_count;
  g_runtime_debug.i2c1.timeout_count = manager->timeout_count;
  g_runtime_debug.i2c1.hardware_error_count = manager->hardware_error_count;
  g_runtime_debug.i2c1.stop_wait_timeout_count =
          manager->stop_wait_timeout_count;
  g_runtime_debug.i2c1.software_reset_count = manager->software_reset_count;
  g_runtime_debug.i2c1.physical_recovery_count =
          manager->physical_recovery_count;
  g_runtime_debug.i2c1.physical_recovery_success_count =
          manager->physical_recovery_success_count;
  g_runtime_debug.i2c1.recovery_failed_count =
          manager->recovery_failed_count;
  g_runtime_debug.i2c1.device_address = manager->device_address;
  g_runtime_debug.i2c1.register_address = manager->register_address;
  g_runtime_debug.i2c1.phase = manager->phase;
  g_runtime_debug.i2c1.last_error_phase = manager->last_error_phase;
  g_runtime_debug.i2c1.last_result = manager->last_result;
  g_runtime_debug.i2c1.bus_free_after_cleanup =
          manager->bus_free_after_cleanup;

  g_runtime_debug.bme280_update_count = bme280_display_data.update_count;
  if(bme280_last_success_tick == 0) g_runtime_debug.bme280_data_age_ms = UINT32_MAX;
  else g_runtime_debug.bme280_data_age_ms = now - bme280_last_success_tick;
  g_runtime_debug.mpu6050_update_count = mpu6050_display_data.update_count;
  if(mpu6050_last_success_tick == 0) g_runtime_debug.mpu6050_data_age_ms = UINT32_MAX;
  else g_runtime_debug.mpu6050_data_age_ms = now - mpu6050_last_success_tick;
  g_runtime_debug.mpu6050_dma_success_count = mpu6050_dma_success_count;
  g_runtime_debug.mpu6050_dma_error_count = mpu6050_dma_error_count;
  g_runtime_debug.mpu6050_queue_error_count = mpu6050_queue_error_count;
  if(rc522_last_liveness_tick == 0) g_runtime_debug.rc522_liveness_age_ms = UINT32_MAX;
  else g_runtime_debug.rc522_liveness_age_ms = now - rc522_last_liveness_tick;
  g_runtime_debug.rc522_liveness_error_count =
          rc522_liveness_error_count;
  g_runtime_debug.rc522_expected_version = rc522_version;
  g_runtime_debug.rc522_last_observed_version =
          rc522_last_observed_version;
  if(nrf_tx_last_success_tick == 0) g_runtime_debug.nrf_tx_success_age_ms = UINT32_MAX;
  else g_runtime_debug.nrf_tx_success_age_ms = now - nrf_tx_last_success_tick;
  g_runtime_debug.nrf_tx_success_count = nrf_tx_success_count;
  g_runtime_debug.nrf_tx_error_count = nrf_tx_error_count;
  if(nrf_rx_last_success_tick == 0) g_runtime_debug.nrf_rx_success_age_ms = UINT32_MAX;
  else g_runtime_debug.nrf_rx_success_age_ms = now - nrf_rx_last_success_tick;
  g_runtime_debug.nrf_rx_packet_count = nrf_rx_packet_count;
  if(ili9341_last_success_tick == 0) g_runtime_debug.ili9341_success_age_ms = UINT32_MAX;
  else g_runtime_debug.ili9341_success_age_ms = now - ili9341_last_success_tick;
  g_runtime_debug.ili9341_dma_success_count = ili9341_dma_success_count;
  g_runtime_debug.ili9341_dma_error_count = ili9341_dma_error_count;
  g_runtime_debug.stale_sensor_mask = stale_mask &
          (SENSOR_STALE_BME280_MASK | SENSOR_STALE_MPU6050_MASK);
  g_runtime_debug.stale_subsystem_mask = stale_mask;
  g_runtime_debug.sensor_data_fresh =
          g_runtime_debug.stale_sensor_mask == 0;
  g_runtime_debug.all_monitored_subsystems_healthy = stale_mask == 0;
  g_runtime_debug.heartbeat_mask = g_system_health.heartbeat_mask;
  g_runtime_debug.missing_heartbeat_mask =
          g_system_health.missing_heartbeat_mask;
  g_runtime_debug.monitor_cycle_count = g_system_health.monitor_cycle_count;
  g_runtime_debug.reset_cause = g_system_health.reset_cause;
  g_runtime_debug.watchdog_feed_count = g_system_health.watchdog_feed_count;
  g_runtime_debug.watchdog_start_failure_count =
          g_system_health.watchdog_start_failure_count;
  g_runtime_debug.last_reset_was_watchdog =
          (g_system_health.reset_cause & RCC_CSR_IWDGRSTF) != 0;
  g_runtime_debug.watchdog_active = g_system_health.watchdog_active;
  g_runtime_debug.startup_grace_active = health_startup_grace_active;
  g_runtime_debug.normal_monitoring_started =
          health_normal_monitoring_started;
  g_runtime_debug.watchdog_feed_allowed =
          health_watchdog_feed_allowed;
  g_runtime_debug.bme280_initialized = bme280_init_completed;
  g_runtime_debug.mpu6050_initialized = mpu6050_init_completed;
  g_runtime_debug.rc522_initialized = rc522_init_completed;
  g_runtime_debug.nrf_tx_initialized = nrf_tx_init_completed;
  g_runtime_debug.nrf_rx_initialized = nrf_rx_init_completed;
  g_runtime_debug.ili9341_initialized = ili9341_init_completed;
}

static bool acquire_i2c_init_lock(void){
  if(i2c_init_mutexHandle == NULL) return false;
  if(osMutexAcquire(i2c_init_mutexHandle, osWaitForever) != osOK){
    return false;
  }

  i2c_init_mutex_acquire_count++;
  i2c_init_mutex_owner_name = osThreadGetName(osThreadGetId());
  return true;
}

static void release_i2c_init_lock(void){
  if(i2c_init_mutexHandle == NULL) return;
  if(osMutexRelease(i2c_init_mutexHandle) == osOK){
    i2c_init_mutex_release_count++;
    i2c_init_mutex_owner_name = NULL;
  }
}

static void register_i2c_sensor_client_ready(void){
  /* Sensor tasks call this while holding i2c_init_mutex. The last required
   * client releases both tasks into their periodic DMA phase. */
  if(i2c_sensor_client_ready_count < I2C_SENSOR_CLIENT_COUNT){
    i2c_sensor_client_ready_count++;
  }
  if(i2c_sensor_client_ready_count < I2C_SENSOR_CLIENT_COUNT ||
          i2c_runtime_ready){
    return;
  }

  i2c_runtime_ready = true;
  i2c_runtime_start_count++;
  osThreadFlagsSet(bme280taskHandle, I2C_RUNTIME_READY_FLAG);
  osThreadFlagsSet(mpu6050taskHandle, I2C_RUNTIME_READY_FLAG);
}

static osStatus_t submit_spi_dma_job(spi_job_t* job){
  if(job == NULL) return osErrorParameter;

  osStatus_t queue_status;
  queue_status = osMessageQueuePut(spi_job_queueHandle, job, 0, 0);
  if(queue_status == osOK && spidmataskHandle != NULL){
    osThreadFlagsSet(spidmataskHandle, SPI_DMA_NEW_JOB_FLAG);
  }
  return queue_status;
}

static ili9341_return_status run_ili9341_dma_operation(
        ili9341_handle_t display){
  if(display == NULL) return _ili9341_fail;

