mechacoredev/stm32f4-freertos-multi-device-hub/Core/Src/main.c
  while(ili9341_operation_is_complete(display) == false){
    spi_job_t job;
    ili9341_return_status display_status;
    display_status = ili9341_build_next_dma_job(display,
            ili9341taskHandle, ILI9341_DMA_SUCCESS_FLAG,
            ILI9341_DMA_ERROR_FLAG, &job);
    if(display_status == _ili9341_complete) return _ili9341_ok;
    if(display_status != _ili9341_ok) return display_status;

    osThreadFlagsClear(ILI9341_DMA_ALL_FLAGS);

    osStatus_t queue_status;
    queue_status = submit_spi_dma_job(&job);
    if(queue_status != osOK){
      ili9341_finish_dma_job(display, false);
      ili9341_dma_error_count++;
      return _ili9341_fail;
    }

    uint32_t result_flags;
    result_flags = osThreadFlagsWait(ILI9341_DMA_ALL_FLAGS,
                                    osFlagsWaitAny,
                                    DMA_DISPATCH_TIMEOUT_MS + 500);
    bool wait_error = (result_flags & osFlagsError) != 0;
    bool dma_succeeded = (result_flags & ILI9341_DMA_SUCCESS_FLAG) != 0;
    bool dma_failed = (result_flags & ILI9341_DMA_ERROR_FLAG) != 0;

    if(wait_error || dma_failed) dma_succeeded = false;

    display_status = ili9341_finish_dma_job(display, dma_succeeded);
    if(display_status != _ili9341_ok){
      ili9341_dma_error_count++;
      return display_status;
    }

    ili9341_dma_success_count++;
    ili9341_last_success_tick = osKernelGetTickCount();
  }

  return _ili9341_ok;
}

static ili9341_return_status draw_ili9341_text(ili9341_handle_t display,
        uint16_t x, uint16_t y, const char* text){
  return draw_ili9341_colored_text(display, x, y, text,
          ILI9341_COLOR_WHITE);
}

static ili9341_return_status draw_ili9341_colored_text(
        ili9341_handle_t display, uint16_t x, uint16_t y, const char* text,
        uint16_t color){
  ili9341_return_status display_status;
  display_status = ili9341_begin_string(display, x, y, text,
          color, ILI9341_COLOR_BLACK);
  if(display_status != _ili9341_ok) return display_status;

  display_status = run_ili9341_dma_operation(display);
  return display_status;
}

static void copy_display_text(char* output, uint8_t output_size,
        const uint8_t* input, uint8_t input_length){
  if(output == NULL || input == NULL || output_size == 0) return;

  uint8_t copy_length = input_length;
  if(copy_length >= output_size) copy_length = output_size - 1;

  uint8_t index = 0;
  while(index < copy_length){
    uint8_t character = input[index];
    if(character < 32 || character > 126) character = ' ';
    output[index] = character;
    index++;
  }
  output[index] = '\0';
}

static void format_text_field(char* output, uint8_t field_width,
        const char* text){
  if(output == NULL || text == NULL || field_width == 0) return;

  uint8_t index = 0;
  while(index < field_width && text[index] != '\0'){
    output[index] = text[index];
    index++;
  }
  while(index < field_width){
    output[index] = ' ';
    index++;
  }
  output[field_width] = '\0';
}

static uint8_t append_unsigned_number(char* output, uint8_t output_index,
        uint32_t value){
  char reverse_digits[10];
  uint8_t digit_count = 0;

  do{
    reverse_digits[digit_count] = '0' + (value % 10);
    digit_count++;
    value /= 10;
  }while(value > 0 && digit_count < sizeof(reverse_digits));

  while(digit_count > 0){
    digit_count--;
    output[output_index] = reverse_digits[digit_count];
    output_index++;
  }

  return output_index;
}

static void format_fixed_2(char* output, uint8_t field_width,
        float value, const char* unit){
  if(output == NULL || unit == NULL || field_width == 0) return;

  bool negative = value < 0.0f;
  float absolute_value = value;
  if(negative) absolute_value = -absolute_value;

  uint32_t scaled_value = (uint32_t)(absolute_value * 100.0f + 0.5f);
  uint32_t integer_part = scaled_value / 100;
  uint32_t fraction_part = scaled_value % 100;

  char formatted_value[32];
  uint8_t output_index = 0;
  if(negative){
    formatted_value[output_index] = '-';
    output_index++;
  }

  output_index = append_unsigned_number(formatted_value, output_index,
          integer_part);
  formatted_value[output_index] = '.';
  output_index++;
  formatted_value[output_index] = '0' + (fraction_part / 10);
  output_index++;
  formatted_value[output_index] = '0' + (fraction_part % 10);
  output_index++;
  formatted_value[output_index] = ' ';
  output_index++;

  uint8_t unit_index = 0;
  while(unit[unit_index] != '\0' && output_index < sizeof(formatted_value) - 1){
    formatted_value[output_index] = unit[unit_index];
    output_index++;
    unit_index++;
  }
  formatted_value[output_index] = '\0';

  format_text_field(output, field_width, formatted_value);
}

static ili9341_return_status draw_sensor_display_layout(void){
  ili9341_return_status display_status;
  char wait_bme[16];
  char wait_mpu[11];
  char wait_radio[23];
  char wait_card[22];
  format_text_field(wait_bme, 15, "WAIT");
  format_text_field(wait_mpu, 10, "WAIT");
  format_text_field(wait_radio, 22, "WAIT");
  format_text_field(wait_card, 21, "WAIT");

  display_status = draw_ili9341_text(my_tft1, 124, 8, "BME280");
  if(display_status != _ili9341_ok) return display_status;
  display_status = draw_ili9341_text(my_tft1, 0, 40, "SIC:");
  if(display_status != _ili9341_ok) return display_status;
  display_status = draw_ili9341_text(my_tft1, 0, 64, "NEM:");
  if(display_status != _ili9341_ok) return display_status;
  display_status = draw_ili9341_text(my_tft1, 0, 88, "BAS:");
  if(display_status != _ili9341_ok) return display_status;
  display_status = draw_ili9341_text(my_tft1, 60, 40, wait_bme);
  if(display_status != _ili9341_ok) return display_status;
  display_status = draw_ili9341_text(my_tft1, 60, 64, wait_bme);
  if(display_status != _ili9341_ok) return display_status;
  display_status = draw_ili9341_text(my_tft1, 60, 88, wait_bme);
  if(display_status != _ili9341_ok) return display_status;
  display_status = draw_ili9341_text(my_tft1, 0, 120, "NRF TX:");
  if(display_status != _ili9341_ok) return display_status;
  display_status = draw_ili9341_text(my_tft1, 84, 120, wait_radio);
  if(display_status != _ili9341_ok) return display_status;
  display_status = draw_ili9341_text(my_tft1, 124, 152, "RC522");
  if(display_status != _ili9341_ok) return display_status;
  display_status = draw_ili9341_text(my_tft1, 0, 176,
          "KART: BEKLENIYOR          ");
  if(display_status != _ili9341_ok) return display_status;
  display_status = draw_ili9341_text(my_tft1, 0, 208, "DATA:");
  if(display_status != _ili9341_ok) return display_status;
  display_status = draw_ili9341_text(my_tft1, 60, 208, wait_card);
  if(display_status != _ili9341_ok) return display_status;

  display_status = draw_ili9341_text(my_tft2, 112, 8, "MPU6500");
  if(display_status != _ili9341_ok) return display_status;
  display_status = draw_ili9341_text(my_tft2, 0, 40, "IVME");
  if(display_status != _ili9341_ok) return display_status;
  display_status = draw_ili9341_text(my_tft2, 160, 40, "JIRO");
  if(display_status != _ili9341_ok) return display_status;

  const uint16_t mpu_y_positions[3] = {64, 88, 112};
  const char* axis_labels[3] = {"X:", "Y:", "Z:"};
  for(uint8_t index = 0; index < 3; index++){
    display_status = draw_ili9341_text(my_tft2, 0,
            mpu_y_positions[index], axis_labels[index]);
    if(display_status != _ili9341_ok) return display_status;
    display_status = draw_ili9341_text(my_tft2, 36,
            mpu_y_positions[index], wait_mpu);
    if(display_status != _ili9341_ok) return display_status;
    display_status = draw_ili9341_text(my_tft2, 160,
            mpu_y_positions[index], axis_labels[index]);
    if(display_status != _ili9341_ok) return display_status;
    display_status = draw_ili9341_text(my_tft2, 196,
            mpu_y_positions[index], wait_mpu);
    if(display_status != _ili9341_ok) return display_status;
  }

  display_status = draw_ili9341_text(my_tft2, 0, 160, "NRF RX:");
  if(display_status != _ili9341_ok) return display_status;
  display_status = draw_ili9341_text(my_tft2, 84, 160, wait_radio);
  if(display_status != _ili9341_ok) return display_status;
  display_status = draw_ili9341_text(my_tft2, 0, 192, "UZUNLUK: WAIT");
  if(display_status != _ili9341_ok) return display_status;

  return _ili9341_ok;
}

static ili9341_return_status refresh_bme280_display(
        const bme280_display_data_t* data){
  if(data == NULL || data->valid == false) return _ili9341_fail;

  char temperature_text[16];
  char humidity_text[16];
  char pressure_text[16];
  format_fixed_2(temperature_text, 15, data->temperature_c, "C");
  format_fixed_2(humidity_text, 15, data->humidity_percent, "%");
  format_fixed_2(pressure_text, 15, data->pressure_pa / 100.0f, "hPa");

