mechacoredev/stm32f4-freertos-multi-device-hub/Core/Src/main.c
  ili9341_return_status display_status;
  display_status = draw_ili9341_text(my_tft1, 60, 40, temperature_text);
  if(display_status != _ili9341_ok) return display_status;
  display_status = draw_ili9341_text(my_tft1, 60, 64, humidity_text);
  if(display_status != _ili9341_ok) return display_status;
  display_status = draw_ili9341_text(my_tft1, 60, 88, pressure_text);
  return display_status;
}

static ili9341_return_status refresh_mpu6050_display(
        const mpu6050_display_data_t* data){
  if(data == NULL || data->valid == false) return _ili9341_fail;

  const uint16_t y_positions[3] = {64, 88, 112};
  char value_text[11];
  ili9341_return_status display_status = _ili9341_ok;

  for(uint8_t index = 0; index < 3; index++){
    format_fixed_2(value_text, 10, data->accel_g[index], "g");
    display_status = draw_ili9341_text(my_tft2, 36,
            y_positions[index], value_text);
    if(display_status != _ili9341_ok) return display_status;
  }

  for(uint8_t index = 0; index < 3; index++){
    format_fixed_2(value_text, 10, data->gyro_dps[index], "dps");
    display_status = draw_ili9341_text(my_tft2, 196,
            y_positions[index], value_text);
    if(display_status != _ili9341_ok) return display_status;
  }

  return _ili9341_ok;
}

static ili9341_return_status refresh_nrf_tx_display(
        const nrf24l01_display_data_t* data){
  if(data == NULL || data->tx_valid == false) return _ili9341_fail;
  char text_field[23];
  format_text_field(text_field, 22, data->tx_text);
  return draw_ili9341_text(my_tft1, 84, 120, text_field);
}

static ili9341_return_status refresh_nrf_rx_display(
        const nrf24l01_display_data_t* data){
  if(data == NULL || data->rx_valid == false) return _ili9341_fail;

  char text_field[20];
  format_text_field(text_field, 19, data->rx_text);
  ili9341_return_status display_status;
  display_status = draw_ili9341_text(my_tft2, 84, 160, text_field);
  if(display_status != _ili9341_ok) return display_status;

  char length_text[4] = {0};
  uint8_t length_index = 0;
  length_index = append_unsigned_number(length_text, length_index,
          data->rx_length);
  length_text[length_index] = '\0';
  char length_field[4];
  format_text_field(length_field, 3, length_text);
  return draw_ili9341_text(my_tft2, 108, 192, length_field);
}

static ili9341_return_status refresh_rc522_display(
        const rc522_display_data_t* data){
  if(data == NULL) return _ili9341_fail;

  ili9341_return_status display_status;
  if(data->card_found == false){
    display_status = draw_ili9341_text(my_tft1, 0, 176,
            "KART: YOK                 ");
    if(display_status != _ili9341_ok) return display_status;

    return draw_ili9341_text(my_tft1, 60, 208,
            "                     ");
  }

  display_status = draw_ili9341_text(my_tft1, 0, 176,
          "KART: BULUNDU             ");
  if(display_status != _ili9341_ok) return display_status;

  char text_field[22];
  format_text_field(text_field, 21, data->block_text);
  uint16_t text_color = ILI9341_COLOR_WHITE;
  if(strncmp(data->block_text, "Mavi", 4) == 0){
    text_color = ILI9341_COLOR_BLUE;
  }
  return draw_ili9341_colored_text(my_tft1, 60, 208, text_field,
          text_color);
}

static void refresh_i2c_dma_debug(i2c_dispatch_slot_t* active_jobs){
  uint8_t active_count = 0;
  for(uint8_t index = 0; index < 3; index++){
    if(active_jobs[index].active == false) continue;
    bool manager_busy;
    manager_busy = i2c_manager_is_dma_busy(active_jobs[index].job.i2c_handle);
    if(manager_busy) active_count++;
  }

  i2c_dma_active_count = active_count;
  if(active_count > i2c_dma_max_concurrent){
    i2c_dma_max_concurrent = active_count;
  }
}

static void refresh_spi_dma_debug(spi_dispatch_slot_t* active_jobs){
  uint8_t active_count = 0;
  for(uint8_t index = 0; index < 3; index++){
    if(active_jobs[index].active == false) continue;
    bool manager_busy;
    manager_busy = spi_manager_is_dma_busy(active_jobs[index].job.spi_handle);
    if(manager_busy) active_count++;
  }

  spi_dma_active_count = active_count;
  if(active_count > spi_dma_max_concurrent){
    spi_dma_max_concurrent = active_count;
  }
}

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */
  system_health_init();
  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */
  // Harici beslenen slave'leri, I2C1 ilk kez etkinlesmeden once kurtar.
  i2c1_startup_recovery_success = recover_i2c1_bus_once();
  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_I2C1_Init();
  MX_SPI1_Init();
  MX_SPI3_Init();
  MX_CAN2_Init();
  /* USER CODE BEGIN 2 */
  i2c1_startup_sr2_after = I2C1->SR2;
  i2c1_startup_recovery_success = i2c1_startup_recovery_success &&
          (i2c1_startup_sr2_after & I2C_SR2_BUSY) == 0;
  i2c1_startup_recovery_completed = true;
  /* USER CODE END 2 */

  /* Init scheduler */
  osKernelInitialize();
  /* Create the mutex(es) */
  /* creation of i2c_mutex */
  i2c_mutexHandle = osMutexNew(&i2c_mutex_attributes);

  /* creation of i2c_init_mutex */
  i2c_init_mutexHandle = osMutexNew(&i2c_init_mutex_attributes);

  /* creation of spi_mutex */
  spi_mutexHandle = osMutexNew(&spi_mutex_attributes);

  /* creation of spi3_mutex */
  spi3_mutexHandle = osMutexNew(&spi3_mutex_attributes);

  /* creation of spi2_mutex */
  spi2_mutexHandle = osMutexNew(&spi2_mutex_attributes);

  /* creation of sensor_data_mutex */
  sensor_data_mutexHandle = osMutexNew(&sensor_data_mutex_attributes);

  /* USER CODE BEGIN RTOS_MUTEX */
  /* USER CODE END RTOS_MUTEX */

  /* Create the semaphores(s) */
  /* creation of dma_semaphore */
  dma_semaphoreHandle = osSemaphoreNew(1, 1, &dma_semaphore_attributes);

  /* creation of spi_semaphore */
  spi_semaphoreHandle = osSemaphoreNew(1, 1, &spi_semaphore_attributes);

  /* creation of spi3_semaphore */
  spi3_semaphoreHandle = osSemaphoreNew(1, 1, &spi3_semaphore_attributes);

