mechacoredev/stm32f4-freertos-multi-device-hub/Core/Src/main.c
  /* creation of spi2_semaphore */
  spi2_semaphoreHandle = osSemaphoreNew(1, 1, &spi2_semaphore_attributes);

  /* USER CODE BEGIN RTOS_SEMAPHORES */
  /* add semaphores, ... */
  i2c_manager_assign_bus(I2C1, i2c_mutexHandle, dma_semaphoreHandle);
  i2c_manager_set_bus_recovery(I2C1, recover_i2c1_bus_runtime);
  spi_manager_assign_bus(SPI1, spi_mutexHandle, spi_semaphoreHandle);
  spi_manager_assign_bus(SPI3, spi3_mutexHandle, spi3_semaphoreHandle);
  /* USER CODE END RTOS_SEMAPHORES */

  /* USER CODE BEGIN RTOS_TIMERS */
  /* start timers, add new ones, ... */
  /* USER CODE END RTOS_TIMERS */

  /* Create the queue(s) */
  /* creation of i2c_job_queue */
  i2c_job_queueHandle = osMessageQueueNew (8, sizeof(i2c_job_t), &i2c_job_queue_attributes);

  /* creation of spi_job_queue */
  spi_job_queueHandle = osMessageQueueNew (8, sizeof(spi_job_t), &spi_job_queue_attributes);

  /* USER CODE BEGIN RTOS_QUEUES */
  /* USER CODE END RTOS_QUEUES */

  /* Create the thread(s) */
  /* creation of bme280task */
  bme280taskHandle = osThreadNew(startbme280task, NULL, &bme280task_attributes);

  /* creation of i2cdmatask */
  i2cdmataskHandle = osThreadNew(starti2cdmatask, NULL, &i2cdmatask_attributes);

  /* creation of rc522task */
#if !REDUCED_I2C_CAN_TEST
  rc522taskHandle = osThreadNew(startrc522task, NULL, &rc522task_attributes);
#endif

  /* creation of mpu6050task */
  mpu6050taskHandle = osThreadNew(startmpu6050task, NULL, &mpu6050task_attributes);

  /* creation of spidmatask */
#if !REDUCED_I2C_CAN_TEST
  spidmataskHandle = osThreadNew(startspidmatask, NULL, &spidmatask_attributes);
#endif

  /* creation of nrf24l01TXtask */
#if !REDUCED_I2C_CAN_TEST
  nrf24l01TXtaskHandle = osThreadNew(startnrf24l01TXtask, NULL, &nrf24l01TXtask_attributes);
#endif

  /* creation of nrf24l01RXtask */
#if !REDUCED_I2C_CAN_TEST
  nrf24l01RXtaskHandle = osThreadNew(startnrf24l01RXtask, NULL, &nrf24l01RXtask_attributes);
#endif

  /* creation of ili9341task */
#if !REDUCED_I2C_CAN_TEST
  ili9341taskHandle = osThreadNew(startili9341task, NULL, &ili9341task_attributes);
#endif

  /* creation of healthtask */
  healthtaskHandle = osThreadNew(starthealthtask, NULL, &healthtask_attributes);

  /* creation of CAN2ReadTask */
  CAN2ReadTaskHandle = osThreadNew(StartCAN2ReadTask, NULL, &CAN2ReadTask_attributes);

  /* creation of CAN2WriteTask */
  CAN2WriteTaskHandle = osThreadNew(StartCAN2WriteTask, NULL, &CAN2WriteTask_attributes);

  /* USER CODE BEGIN RTOS_THREADS */
  system_health_register_task(HEALTH_TASK_BME280, bme280taskHandle);
  system_health_register_task(HEALTH_TASK_I2C_DISPATCH, i2cdmataskHandle);
#if !REDUCED_I2C_CAN_TEST
  system_health_register_task(HEALTH_TASK_RC522, rc522taskHandle);
#endif
  system_health_register_task(HEALTH_TASK_MPU6050, mpu6050taskHandle);
#if !REDUCED_I2C_CAN_TEST
  system_health_register_task(HEALTH_TASK_SPI_DISPATCH, spidmataskHandle);
  system_health_register_task(HEALTH_TASK_NRF_TX, nrf24l01TXtaskHandle);
  system_health_register_task(HEALTH_TASK_NRF_RX, nrf24l01RXtaskHandle);
  system_health_register_task(HEALTH_TASK_DISPLAY, ili9341taskHandle);
#endif
  system_health_register_task(HEALTH_TASK_CAN_RX, CAN2ReadTaskHandle);
  system_health_register_task(HEALTH_TASK_CAN_TX, CAN2WriteTaskHandle);
  /* USER CODE END RTOS_THREADS */

  /* USER CODE BEGIN RTOS_EVENTS */
  /* add events, ... */
  /* USER CODE END RTOS_EVENTS */

  /* Start scheduler */
  osKernelStart();

  /* We should never get here as control is now taken by the scheduler */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  LL_FLASH_SetLatency(LL_FLASH_LATENCY_5);
  while(LL_FLASH_GetLatency()!= LL_FLASH_LATENCY_5)
  {
  }
  LL_PWR_SetRegulVoltageScaling(LL_PWR_REGU_VOLTAGE_SCALE1);
  LL_RCC_HSI_SetCalibTrimming(16);
  LL_RCC_HSI_Enable();

   /* Wait till HSI is ready */
  while(LL_RCC_HSI_IsReady() != 1)
  {

  }
  LL_RCC_PLL_ConfigDomain_SYS(LL_RCC_PLLSOURCE_HSI, LL_RCC_PLLM_DIV_8, 160, LL_RCC_PLLP_DIV_2);
  LL_RCC_PLL_Enable();

   /* Wait till PLL is ready */
  while(LL_RCC_PLL_IsReady() != 1)
  {

  }
  while (LL_PWR_IsActiveFlag_VOS() == 0)
  {
  }
  LL_RCC_SetAHBPrescaler(LL_RCC_SYSCLK_DIV_1);
  LL_RCC_SetAPB1Prescaler(LL_RCC_APB1_DIV_4);
  LL_RCC_SetAPB2Prescaler(LL_RCC_APB2_DIV_2);
  LL_RCC_SetSysClkSource(LL_RCC_SYS_CLKSOURCE_PLL);

   /* Wait till System clock is ready */
  while(LL_RCC_GetSysClkSource() != LL_RCC_SYS_CLKSOURCE_STATUS_PLL)
  {

  }
  LL_SetSystemCoreClock(160000000);

   /* Update the time base */
  if (HAL_InitTick (TICK_INT_PRIORITY) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief CAN2 Initialization Function
  * @param None
  * @retval None
  */
static void MX_CAN2_Init(void)
{

  /* USER CODE BEGIN CAN2_Init 0 */

  /* USER CODE END CAN2_Init 0 */

  /* USER CODE BEGIN CAN2_Init 1 */

  /* USER CODE END CAN2_Init 1 */
  hcan2.Instance = CAN2;
  hcan2.Init.Prescaler = 8;
  hcan2.Init.Mode = CAN_MODE_NORMAL;
  hcan2.Init.SyncJumpWidth = CAN_SJW_1TQ;
  hcan2.Init.TimeSeg1 = CAN_BS1_7TQ;
  hcan2.Init.TimeSeg2 = CAN_BS2_2TQ;
  hcan2.Init.TimeTriggeredMode = DISABLE;
  hcan2.Init.AutoBusOff = ENABLE;
  hcan2.Init.AutoWakeUp = DISABLE;
  hcan2.Init.AutoRetransmission = ENABLE;
  hcan2.Init.ReceiveFifoLocked = DISABLE;
  hcan2.Init.TransmitFifoPriority = DISABLE;
  if (HAL_CAN_Init(&hcan2) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN CAN2_Init 2 */

  /* USER CODE END CAN2_Init 2 */

}

/**
  * @brief I2C1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_I2C1_Init(void)
{

  /* USER CODE BEGIN I2C1_Init 0 */

  /* USER CODE END I2C1_Init 0 */

  LL_I2C_InitTypeDef I2C_InitStruct = {0};

  LL_GPIO_InitTypeDef GPIO_InitStruct = {0};

  LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOB);
  /**I2C1 GPIO Configuration
  PB6   ------> I2C1_SCL
  PB7   ------> I2C1_SDA
  */
  GPIO_InitStruct.Pin = LL_GPIO_PIN_6|LL_GPIO_PIN_7;
  GPIO_InitStruct.Mode = LL_GPIO_MODE_ALTERNATE;
  GPIO_InitStruct.Speed = LL_GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.OutputType = LL_GPIO_OUTPUT_OPENDRAIN;
  GPIO_InitStruct.Pull = LL_GPIO_PULL_UP;
  GPIO_InitStruct.Alternate = LL_GPIO_AF_4;
  LL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /* Peripheral clock enable */
  LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_I2C1);

  /* I2C1 DMA Init */

  /* I2C1_RX Init */
  LL_DMA_SetChannelSelection(DMA1, LL_DMA_STREAM_0, LL_DMA_CHANNEL_1);

  LL_DMA_SetDataTransferDirection(DMA1, LL_DMA_STREAM_0, LL_DMA_DIRECTION_PERIPH_TO_MEMORY);

