mechacoredev/stm32f4-freertos-multi-device-hub/Core/Src/main.c
	bme280_user_configs bme_cfg = {0};

	bme_cfg.i2c_handle = I2C1;
	bme_cfg.dma_handle = DMA1;
	bme_cfg.dma_stream = LL_DMA_STREAM_0;
	bme_cfg.i2c_addr = bme280_i2c_addr0;

	bme_cfg.config_t.bits.t_sb = 0;
	bme_cfg.config_t.bits.filter = 0;
	bme_cfg.config_t.bits.spi_en = 0;
	bme_cfg.ctrlhum_t.bits.osrs_h = 1;
	bme_cfg.ctrlmeas_t.bits.osrs_t = 1;
	bme_cfg.ctrlmeas_t.bits.osrs_p = 1;
	bme_cfg.ctrlmeas_t.bits.mode = 3;

	if(!acquire_i2c_init_lock()){
	  for(;;) osDelay(1000);
	}

	my_bme280 = bme280_init(&bme_cfg);

	if(my_bme280 == NULL){
	    release_i2c_init_lock();
	    for(;;){
	      osDelay(1000);
	    }
	}
	bme280_init_completed = true;
	bme280_last_success_tick = osKernelGetTickCount();
	register_i2c_sensor_client_ready();
	release_i2c_init_lock();

	uint32_t runtime_flags = osThreadFlagsWait(I2C_RUNTIME_READY_FLAG,
	        osFlagsWaitAny, osWaitForever);
	if((runtime_flags & I2C_RUNTIME_READY_FLAG) == 0){
	  for(;;) osDelay(1000);
	}

	const uint32_t bme280_period_ms = 100;
	uint32_t bme280_next_wake = osKernelGetTickCount();

  /* Infinite loop */
  for(;;)
  {
	  system_health_heartbeat(HEALTH_TASK_BME280);
	  bme280_next_wake += bme280_period_ms;
	  osDelayUntil(bme280_next_wake);

	  i2c_job_t job;
	  osThreadFlagsClear(BME280_DMA_ALL_FLAGS);
	  if(bme280_build_read_job(my_bme280, bme280taskHandle,
	          BME280_DMA_SUCCESS_FLAG, BME280_DMA_ERROR_FLAG,
	          &job) == _bme280_ok)
	  {
	      if(submit_i2c_dma_job(&job) == osOK)
	      {
	          uint32_t result_flags = osThreadFlagsWait(BME280_DMA_ALL_FLAGS,
	                  osFlagsWaitAny, 1000);
	          if((result_flags & BME280_DMA_SUCCESS_FLAG) != 0)
	          {
	              bme280_return_status bme_status;
	              bme_status = bme280_get_value(my_bme280);
	              if(bme_status == _bme280_ok){
	                float temperature;
	                float humidity;
	                float pressure;
	                bme280_get_measurements(my_bme280, &temperature,
	                        &humidity, &pressure);
	                bme280_last_success_tick = osKernelGetTickCount();

	                osStatus_t mutex_status;
	                mutex_status = osMutexAcquire(sensor_data_mutexHandle, 10);
	                if(mutex_status == osOK){
	                  bme280_display_data.temperature_c = temperature;
	                  bme280_display_data.humidity_percent = humidity;
	                  bme280_display_data.pressure_pa = pressure;
	                  bme280_display_data.valid = true;
	                  bme280_display_data.update_count++;
	                  osMutexRelease(sensor_data_mutexHandle);
	                }
	              }
	          }
	      }
	  }
  }
  /* USER CODE END 5 */
}

/* USER CODE BEGIN Header_starti2cdmatask */
/**
* @brief Function implementing the parallel I2C DMA dispatcher thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_starti2cdmatask */
void starti2cdmatask(void *argument)
{
  /* USER CODE BEGIN starti2cdmatask */
  system_health_heartbeat(HEALTH_TASK_I2C_DISPATCH);

  i2c_dispatch_slot_t active_jobs[3] = {0};
  const uint32_t completion_flags[3] = {
    I2C1_DMA_DONE_FLAG,
    I2C2_DMA_DONE_FLAG,
    I2C3_DMA_DONE_FLAG
  };

  i2c_manager_set_dispatch_notification(I2C1, i2cdmataskHandle, I2C1_DMA_DONE_FLAG);
  i2c_manager_set_dispatch_notification(I2C2, i2cdmataskHandle, I2C2_DMA_DONE_FLAG);
  i2c_manager_set_dispatch_notification(I2C3, i2cdmataskHandle, I2C3_DMA_DONE_FLAG);
  i2c_manager_set_job_service(i2c_job_queueHandle, i2cdmataskHandle,
          I2C_DMA_NEW_JOB_FLAG);

  while(osSemaphoreAcquire(dma_semaphoreHandle, 0) == osOK) { }
  osThreadFlagsClear(I2C_DMA_ALL_FLAGS);

  bool startup_bus_ready = i2c1_startup_recovery_completed &&
          i2c1_startup_recovery_success;
  if(startup_bus_ready){
    osThreadFlagsSet(bme280taskHandle, I2C_WORKER_READY_FLAG);
    osThreadFlagsSet(mpu6050taskHandle, I2C_WORKER_READY_FLAG);
  }

  /* Infinite loop */
  for(;;)
  {
    system_health_heartbeat(HEALTH_TASK_I2C_DISPATCH);
    uint32_t pending_flags;
    pending_flags = osThreadFlagsWait(I2C_DMA_ALL_FLAGS, osFlagsWaitAny, 10);
    bool flag_wait_error = (pending_flags & osFlagsError) != 0;
    if(flag_wait_error) pending_flags = 0;
    uint32_t now = osKernelGetTickCount();

    for(uint8_t index = 0; index < 3; index++){
      bool transfer_finished = (pending_flags & completion_flags[index]) != 0;
      if(transfer_finished && active_jobs[index].active){
        i2c_manager_return_status completed_status;
        completed_status = i2c_manager_unlock_bus(
                active_jobs[index].job.i2c_handle);
        complete_i2c_job(&active_jobs[index].job, completed_status);
        active_jobs[index].active = false;
        refresh_i2c_dma_debug(active_jobs);
      }

      if(active_jobs[index].active){
        uint32_t elapsed_time = now - active_jobs[index].start_tick;
        if(elapsed_time >= DMA_DISPATCH_TIMEOUT_MS){
          i2c_manager_abort_transfer(active_jobs[index].job.i2c_handle);
          complete_i2c_job(&active_jobs[index].job,
                  _i2c_manager_aborted);
          active_jobs[index].active = false;
          refresh_i2c_dma_debug(active_jobs);
        }
      }
    }

    uint32_t queued_job_count = osMessageQueueGetCount(i2c_job_queueHandle);
    for(uint32_t queue_index = 0; queue_index < queued_job_count; queue_index++){
      i2c_job_t job;
      osStatus_t queue_status;
      queue_status = osMessageQueueGet(i2c_job_queueHandle, &job, NULL, 0);
      if(queue_status != osOK) break;

      int8_t dispatch_index = get_i2c_dispatch_index(job.i2c_handle);
      if(dispatch_index < 0){
        complete_i2c_job(&job, _i2c_manager_uninited_struct);
        continue;
      }

      bool polling_job = job.operation != I2C_JOB_READ_DMA;
      if(polling_job){
        if(active_jobs[dispatch_index].active){
          requeue_i2c_job(&job);
          continue;
        }

        i2c_last_polling_job_status =
                i2c_manager_execute_polling_job(&job);
        i2c_polling_job_count++;
        complete_i2c_job(&job, i2c_last_polling_job_status);
        continue;
      }

      bool dma_resource_busy = false;
      for(uint8_t active_index = 0; active_index < 3; active_index++){
        if(active_jobs[active_index].active == false) continue;
        bool same_dma = active_jobs[active_index].job.dma_handle == job.dma_handle;
        bool same_stream = active_jobs[active_index].job.dma_stream == job.dma_stream;
        if(same_dma && same_stream){
          dma_resource_busy = true;
          break;
        }
      }

      if(active_jobs[dispatch_index].active || dma_resource_busy){
        requeue_i2c_job(&job);
        continue;
      }

      active_jobs[dispatch_index].active = true;
      active_jobs[dispatch_index].start_tick = osKernelGetTickCount();
      active_jobs[dispatch_index].job = job;

