mechacoredev/stm32f4-freertos-multi-device-hub/Core/Src/main.c
      i2c_manager_return_status transfer_status;
      transfer_status = i2c_manager_read_dma(job.dma_handle, job.dma_stream,
                                             job.i2c_handle, job.dev_addr,
                                             job.reg_addr, job.rxdata, job.size);
      if(transfer_status == _i2c_manager_ok){
        i2c_dma_job_count++;
        refresh_i2c_dma_debug(active_jobs);
        continue;
      }

      active_jobs[dispatch_index].active = false;
      if(transfer_status == _i2c_manager_busy){
        /* Bu durum yalnizca kisa sureli mutex/kaynak cakismasidir. Fiziksel
         * BUSY i2c_manager icinde bir kez kurtarilir; kurtarilamazsa hata ile
         * tamamlanir ve sonsuz requeue dongusune girmez. */
        if(job.i2c_handle == I2C1) i2c1_runtime_busy_requeue_count++;
        requeue_i2c_job(&job);
      }
      else{
        complete_i2c_job(&job, transfer_status);
      }
    }
  }
  /* USER CODE END starti2cdmatask */
}

/* USER CODE BEGIN Header_startrc522task */
/**
* @brief Function implementing the rc522task thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_startrc522task */
void startrc522task(void *argument)
{
  /* USER CODE BEGIN startrc522task */
	rc522_user_configs rc522_cfg = {0};

	rc522_cfg.spi_handle = SPI1;
	rc522_cfg.cs_port = rc522_cs_pin_GPIO_Port;
	rc522_cfg.cs_pin = rc522_cs_pin_Pin;
	rc522_cfg.rst_port = rc522_rst_pin_GPIO_Port;
	rc522_cfg.rst_pin = rc522_rst_pin_Pin;

	my_rc522 = rc522_init(&rc522_cfg);

	if(my_rc522 == NULL){
		for(;;){
		  osDelay(1000);
		}
	}
	rc522_version = rc522_get_version(my_rc522);
	rc522_last_observed_version = rc522_version;
	if(rc522_version == 0 || rc522_version == 0xFF){
		for(;;){
		  osDelay(1000);
		}
	}
	rc522_init_completed = true;
	(void)spi_manager_register_validator(SPI1, validate_rc522_spi, my_rc522);
	rc522_last_liveness_tick = osKernelGetTickCount();
	osStatus_t initial_display_mutex;
	initial_display_mutex = osMutexAcquire(sensor_data_mutexHandle, 10);
	if(initial_display_mutex == osOK){
	  rc522_display_data.card_found = false;
	  memset(rc522_display_data.block_text, 0,
	          sizeof(rc522_display_data.block_text));
	  rc522_display_data.update_count++;
	  osMutexRelease(sensor_data_mutexHandle);
	}

	rc522_assign_interrupt_task(my_rc522, rc522taskHandle, 0x04);
	rc522_set_active_irq_device(my_rc522);

	uint8_t card_type[2];
	uint8_t card_uid[5];
	uint8_t status;
	uint8_t card_size;

	uint8_t keyA[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
	uint8_t block_to_read = 4;
	uint8_t block_data[16];
	uint8_t block_data2[16];
	int16_t counter = 0;
	uint8_t counter2 = 0;
	uint8_t data_to_write[16]  = "Beyaz :)";
	uint8_t data_to_write2[16] = "Mavi :)";
	const uint32_t card_absent_timeout_ms = 1500;
	uint32_t last_card_seen_tick = osKernelGetTickCount();
	uint32_t next_liveness_check_tick = osKernelGetTickCount();
	bool card_display_active = false;
	uint8_t displayed_card_uid[5] = {0};

  /* Infinite loop */
  for(;;)
  {
	  system_health_heartbeat(HEALTH_TASK_RC522);
	  uint32_t loop_tick = osKernelGetTickCount();
	  if((int32_t)(loop_tick - next_liveness_check_tick) >= 0){
	    next_liveness_check_tick = loop_tick +
	            RC522_LIVENESS_CHECK_PERIOD_MS;
	    uint8_t current_version = rc522_get_version(my_rc522);
	    rc522_last_observed_version = current_version;
	    if(current_version == rc522_version){
	      rc522_last_liveness_tick = loop_tick;
	    }
	    else{
	      rc522_liveness_error_count++;
	    }
	  }
	  memset(card_type, 0, 2);
	  memset(card_uid, 0, 5);
	  card_size = 0;

	  rc522_stop_crypto1(my_rc522);

	  status = rc522_request(my_rc522, PICC_REQALL, card_type);
	  rc522_last_request_status = status;
	  if(status == MI_OK){
		  status = rc522_anticoll(my_rc522, card_uid);
		  rc522_last_anticoll_status = status;
		  if(status == MI_OK){
			  for(uint8_t uid_index = 0; uid_index < 5; uid_index++){
				  rc522_last_uid[uid_index] = card_uid[uid_index];
			  }
			  rc522_detection_count++;

			  if((card_uid[0] == 193) && (card_uid[1] == 99) && (card_uid[2] == 247) && (card_uid[3] == 3) && (card_uid[4] == 86)){
				  card_size = rc522_select_tag(my_rc522, card_uid);
				  if(card_size != 0){
					  status = rc522_auth(my_rc522, PICC_AUTHENT1A, block_to_read, keyA, card_uid);
					  if(status == MI_OK){
						  if(counter == 0){
							  counter++;
							  rc522_write(my_rc522, block_to_read, data_to_write);
						  }
						  status = rc522_read(my_rc522, block_to_read, block_data);
						  if(status == MI_OK){
						    last_card_seen_tick = osKernelGetTickCount();
						    bool card_changed = card_display_active == false ||
						            memcmp(displayed_card_uid, card_uid,
						                    sizeof(displayed_card_uid)) != 0;
						    if(card_changed){
						      osStatus_t mutex_status;
						      mutex_status = osMutexAcquire(sensor_data_mutexHandle, 10);
						      if(mutex_status == osOK){
						        rc522_display_data.card_found = true;
						        copy_display_text(rc522_display_data.block_text,
						                sizeof(rc522_display_data.block_text), block_data, 16);
						        rc522_display_data.update_count++;
						        osMutexRelease(sensor_data_mutexHandle);
						        memcpy(displayed_card_uid, card_uid,
						                sizeof(displayed_card_uid));
						        card_display_active = true;
						      }
						    }
						  }
						  rc522_halt(my_rc522);
					  }
				  }
			  }

			  if((card_uid[0] == 162) && (card_uid[1] == 98) && (card_uid[2] == 192) && (card_uid[3] == 1) && (card_uid[4] == 1)){
				  card_size = rc522_select_tag(my_rc522, card_uid);
				  if(card_size != 0){
					  status = rc522_auth(my_rc522, PICC_AUTHENT1A, block_to_read, keyA, card_uid);
					  if(status == MI_OK){
						  if(counter2 == 0){
							  counter2++;
							  rc522_write(my_rc522, block_to_read, data_to_write2);
						  }
						  status = rc522_read(my_rc522, block_to_read, block_data2);
						  if(status == MI_OK){
						    last_card_seen_tick = osKernelGetTickCount();
						    bool card_changed = card_display_active == false ||
						            memcmp(displayed_card_uid, card_uid,
						                    sizeof(displayed_card_uid)) != 0;
						    if(card_changed){
						      osStatus_t mutex_status;
						      mutex_status = osMutexAcquire(sensor_data_mutexHandle, 10);
						      if(mutex_status == osOK){
						        rc522_display_data.card_found = true;
						        copy_display_text(rc522_display_data.block_text,
						                sizeof(rc522_display_data.block_text), block_data2, 16);
						        rc522_display_data.update_count++;
						        osMutexRelease(sensor_data_mutexHandle);
						        memcpy(displayed_card_uid, card_uid,
						                sizeof(displayed_card_uid));
						        card_display_active = true;
						      }
						    }
						  }
						  rc522_halt(my_rc522);
					  }
				  }
			  }
		  }
	  }
	  uint32_t now = osKernelGetTickCount();
	  if(card_display_active &&
	     (now - last_card_seen_tick) >= card_absent_timeout_ms){
	    osStatus_t mutex_status;
	    mutex_status = osMutexAcquire(sensor_data_mutexHandle, 10);
	    if(mutex_status == osOK){
	      rc522_display_data.card_found = false;
	      memset(rc522_display_data.block_text, 0,
	              sizeof(rc522_display_data.block_text));
	      rc522_display_data.update_count++;
	      osMutexRelease(sensor_data_mutexHandle);
	      memset(displayed_card_uid, 0, sizeof(displayed_card_uid));
	      card_display_active = false;
	    }
	  }
	  osDelay(50);
  }
  /* USER CODE END startrc522task */
}

