mechacoredev/stm32f4-freertos-multi-device-hub/Core/Src/main.c
/* USER CODE BEGIN Header_startmpu6050task */
/**
* @brief Function implementing the mpu6050task thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_startmpu6050task */
void startmpu6050task(void *argument)
{
  /* USER CODE BEGIN startmpu6050task */
	uint32_t startup_flags = osThreadFlagsWait(I2C_WORKER_READY_FLAG,
	        osFlagsWaitAny, osWaitForever);
	if((startup_flags & I2C_WORKER_READY_FLAG) == 0){
	  for(;;) osDelay(1000);
	}

	mpu6050_user_configs mpu_cfg = {0};

	mpu_cfg.i2c_handle = I2C1;
	mpu_cfg.i2c_addr = mpu6050_i2c_addr_0;
	mpu_cfg.dma_handle = DMA1;
	mpu_cfg.dma_stream = LL_DMA_STREAM_0;
	mpu_cfg.sample_rate = 9;

	mpu_cfg.config_t.bits.dlpf_cfg = 3;
	mpu_cfg.config_t.bits.ext_sync_set = 0;
	mpu_cfg.gyro_config_t.bits.fs_sel = 0;
	mpu_cfg.accel_config_t.bits.afs_sel = 0;

	// FIFO bu canli veri uygulamasinda iki modda da kapali.
	mpu_cfg.fifo_en_t.raw = 0;
	mpu_cfg.user_ctrl_t.raw = 0;

#if MPU6050_USE_DATA_READY_INTERRUPT
	mpu_cfg.int_pin_cfg_t.bits.int_level = 0;
	mpu_cfg.int_pin_cfg_t.bits.int_open = 0;
	mpu_cfg.int_pin_cfg_t.bits.latch_int_en = 1;
	mpu_cfg.int_pin_cfg_t.bits.int_rd_clear = 1;
	mpu_cfg.int_enable_t.bits.data_rdy_en = 1;
#else
	// Kontrollu A/B testi: MPU interrupt kaynaklari tamamen kapali.
	mpu_cfg.int_pin_cfg_t.raw = 0;
	mpu_cfg.int_enable_t.raw = 0;
#endif

	mpu_cfg.pwr_mgmt_1_t.bits.sleep = 0;
	mpu_cfg.pwr_mgmt_1_t.bits.clksel = 0;
	mpu_cfg.pwr_mgmt_1_t.bits.temp_dis = 0;
	mpu_cfg.pwr_mgmt_1_t.bits.cycle = 0;
	mpu_cfg.pwr_mgmt_2_t.raw = 0;

	if(!acquire_i2c_init_lock()){
	  for(;;) osDelay(1000);
	}
	my_mpu6050 = mpu6050_init(&mpu_cfg);
	if(my_mpu6050 == NULL){
		release_i2c_init_lock();
		for(;;){
		  osDelay(1000);
		}
	}

#if MPU6050_USE_DATA_READY_INTERRUPT
	mpu6050_assign_interrupt_task(my_mpu6050, mpu6050taskHandle,
	        MPU6050_DATA_READY_FLAG);
	mpu6050_set_active_irq_device(my_mpu6050);
#endif

	if(mpu6050_configurate(my_mpu6050) != _mpu6050_ok){
		release_i2c_init_lock();
		for(;;){
		  osDelay(1000);
		}
	}

#if MPU6050_USE_DATA_READY_INTERRUPT
	mpu6050_int_status_t startup_int_status = {0};
	mpu6050_startup_int_clear_success =
	        mpu6050_read_int_status(my_mpu6050, &startup_int_status) ==
	        _mpu6050_ok;
	mpu6050_startup_int_was_data_ready = startup_int_status.data_rdy;
	osThreadFlagsClear(MPU6050_DATA_READY_FLAG);
	LL_EXTI_ClearFlag_0_31(LL_EXTI_LINE_1);
#endif
	mpu6050_init_completed = true;
	mpu6050_last_success_tick = osKernelGetTickCount();
	register_i2c_sensor_client_ready();
	release_i2c_init_lock();

	uint32_t runtime_flags = osThreadFlagsWait(I2C_RUNTIME_READY_FLAG,
	        osFlagsWaitAny, osWaitForever);
	if((runtime_flags & I2C_RUNTIME_READY_FLAG) == 0){
	  for(;;) osDelay(1000);
	}

#if !MPU6050_USE_DATA_READY_INTERRUPT
	const uint32_t mpu6050_period_ms = 100;
	uint32_t mpu6050_next_wake = osKernelGetTickCount();
#endif

  /* Infinite loop */
  for(;;)
  {
	  system_health_heartbeat(HEALTH_TASK_MPU6050);
#if MPU6050_USE_DATA_READY_INTERRUPT
	  uint32_t irq_flags = osThreadFlagsWait(MPU6050_DATA_READY_FLAG,
	          osFlagsWaitAny, 100);
	  bool irq_received = (irq_flags & MPU6050_DATA_READY_FLAG) != 0;
	  bool interrupt_pin_high = LL_GPIO_IsInputPinSet(
	          mpu6050_irq_pin_GPIO_Port, mpu6050_irq_pin_Pin) != 0;

	  // Rising edge nadiren kacarsa latched HIGH seviyeyi DMA okumasi ile kurtar.
	  if(irq_received == false){
	    if(interrupt_pin_high == false) continue;
	    mpu6050_irq_level_recovery_count++;
	  }

	  // Tek etkin MPU kaynagi DATA_READY. INT_RD_CLEAR=1 oldugu icin bu
	  // 14-baytlik register okumasi interrupt latch'ini de otomatik temizler.
	  i2c_job_t job;
	  osThreadFlagsClear(MPU6050_DMA_SUCCESS_FLAG |
	          MPU6050_DMA_ERROR_FLAG);
	  mpu6050_return_status build_status;
	  build_status = mpu6050_build_data_job(my_mpu6050,
	          mpu6050taskHandle, MPU6050_DMA_SUCCESS_FLAG,
	          MPU6050_DMA_ERROR_FLAG, &job);
	  if(build_status != _mpu6050_ok){
	    mpu6050_dma_error_count++;
	    osDelay(I2C_SENSOR_ERROR_BACKOFF_MS);
	    continue;
	  }

	  if(submit_i2c_dma_job(&job) != osOK){
	    mpu6050_queue_error_count++;
	    osDelay(I2C_SENSOR_ERROR_BACKOFF_MS);
	    continue;
	  }

	  uint32_t dma_flags = osThreadFlagsWait(
	          MPU6050_DMA_SUCCESS_FLAG | MPU6050_DMA_ERROR_FLAG,
	          osFlagsWaitAny, 500);
	  bool wait_error = (dma_flags & osFlagsError) != 0;
	  bool dma_finished = (dma_flags & MPU6050_DMA_SUCCESS_FLAG) != 0;
	  if(wait_error || dma_finished == false){
	    mpu6050_dma_error_count++;
	    osDelay(I2C_SENSOR_ERROR_BACKOFF_MS);
	    continue;
	  }

	  if(mpu6050_get_values(my_mpu6050) != _mpu6050_ok){
	    mpu6050_dma_error_count++;
	    osDelay(I2C_SENSOR_ERROR_BACKOFF_MS);
	    continue;
	  }
	  mpu6050_last_success_tick = osKernelGetTickCount();

	  float accel[3];
	  float gyro[3];
	  mpu6050_get_accel_g(my_mpu6050, accel);
	  mpu6050_get_gyro_dps(my_mpu6050, gyro);

	  osStatus_t mutex_status;
	  mutex_status = osMutexAcquire(sensor_data_mutexHandle, 10);
	  if(mutex_status == osOK){
	    for(uint8_t index = 0; index < 3; index++){
	      mpu6050_display_data.accel_g[index] = accel[index];
	      mpu6050_display_data.gyro_dps[index] = gyro[index];
	    }
	    mpu6050_display_data.valid = true;
	    mpu6050_display_data.update_count++;
	    osMutexRelease(sensor_data_mutexHandle);
	    mpu6050_dma_success_count++;
	  }
#else
	  mpu6050_next_wake += mpu6050_period_ms;
	  osDelayUntil(mpu6050_next_wake);

	  i2c_job_t job;
	  osThreadFlagsClear(MPU6050_ALL_FLAGS);
	  mpu6050_return_status build_status;
	  build_status = mpu6050_build_data_job(my_mpu6050,
	          mpu6050taskHandle, MPU6050_DMA_SUCCESS_FLAG,
	          MPU6050_DMA_ERROR_FLAG, &job);
	  if(build_status != _mpu6050_ok){
	    mpu6050_dma_error_count++;
	    osDelay(I2C_SENSOR_ERROR_BACKOFF_MS);
	    continue;
	  }

	  if(submit_i2c_dma_job(&job) != osOK){
	    mpu6050_queue_error_count++;
	    osDelay(I2C_SENSOR_ERROR_BACKOFF_MS);
	    continue;
	  }

	  uint32_t dma_flags = osThreadFlagsWait(
	          MPU6050_DMA_SUCCESS_FLAG | MPU6050_DMA_ERROR_FLAG,
	          osFlagsWaitAny, 500);
	  bool wait_error = (dma_flags & osFlagsError) != 0;
	  bool dma_finished = (dma_flags & MPU6050_DMA_SUCCESS_FLAG) != 0;
	  if(wait_error || dma_finished == false){
	    mpu6050_dma_error_count++;
	    osDelay(I2C_SENSOR_ERROR_BACKOFF_MS);
	    continue;
	  }

	  if(mpu6050_get_values(my_mpu6050) != _mpu6050_ok){
	    mpu6050_dma_error_count++;
	    osDelay(I2C_SENSOR_ERROR_BACKOFF_MS);
	    continue;
	  }
	  mpu6050_last_success_tick = osKernelGetTickCount();

	  float accel[3];
	  float gyro[3];
	  mpu6050_get_accel_g(my_mpu6050, accel);
	  mpu6050_get_gyro_dps(my_mpu6050, gyro);

	  osStatus_t mutex_status;
	  mutex_status = osMutexAcquire(sensor_data_mutexHandle, 10);
	  if(mutex_status == osOK){
	    for(uint8_t index = 0; index < 3; index++){
	      mpu6050_display_data.accel_g[index] = accel[index];
	      mpu6050_display_data.gyro_dps[index] = gyro[index];
	    }
	    mpu6050_display_data.valid = true;
	    mpu6050_display_data.update_count++;
	    osMutexRelease(sensor_data_mutexHandle);
	    mpu6050_dma_success_count++;
	  }
#endif
  }
  /* USER CODE END startmpu6050task */
}

/* USER CODE BEGIN Header_startspidmatask */
/**
* @brief Function implementing the central SPI DMA worker thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_startspidmatask */
void startspidmatask(void *argument)
{
  /* USER CODE BEGIN startspidmatask */
  spi_dispatch_slot_t active_jobs[3] = {0};
  const uint32_t completion_flags[3] = {
    SPI1_DMA_DONE_FLAG,
    SPI2_DMA_DONE_FLAG,
    SPI3_DMA_DONE_FLAG
  };

  spi_manager_set_dispatch_notification(SPI1, spidmataskHandle, SPI1_DMA_DONE_FLAG);
  spi_manager_set_dispatch_notification(SPI3, spidmataskHandle, SPI3_DMA_DONE_FLAG);

  while(osSemaphoreAcquire(spi_semaphoreHandle, 0) == osOK) { }
  while(osSemaphoreAcquire(spi3_semaphoreHandle, 0) == osOK) { }
  osThreadFlagsClear(SPI_DMA_ALL_FLAGS);
  spi_dispatch_ready = true;

  for(;;)
  {
    system_health_heartbeat(HEALTH_TASK_SPI_DISPATCH);
    uint32_t pending_flags;
    pending_flags = osThreadFlagsWait(SPI_DMA_ALL_FLAGS, osFlagsWaitAny, 10);
    bool flag_wait_error = (pending_flags & osFlagsError) != 0;
    if(flag_wait_error) pending_flags = 0;
    uint32_t now = osKernelGetTickCount();

    for(uint8_t index = 0; index < 3; index++){
      bool transfer_finished = (pending_flags & completion_flags[index]) != 0;
      if(transfer_finished && active_jobs[index].active){
        bool transfer_succeeded;
        transfer_succeeded = spi_manager_last_transfer_succeeded(
                active_jobs[index].job.spi_handle);
        spi_manager_unlock_bus(active_jobs[index].job.spi_handle);

        uint32_t result_flag = active_jobs[index].job.error_flag;
        if(transfer_succeeded){
          result_flag = active_jobs[index].job.notify_flag;
        }

