mechacoredev/stm32f4-freertos-multi-device-hub/Core/Src/main.c
        if(active_jobs[index].job.notify_task != NULL && result_flag != 0){
          osThreadFlagsSet(active_jobs[index].job.notify_task, result_flag);
        }
        active_jobs[index].active = false;
        refresh_spi_dma_debug(active_jobs);
      }

      if(active_jobs[index].active){
        uint32_t elapsed_time = now - active_jobs[index].start_tick;
        if(elapsed_time >= DMA_DISPATCH_TIMEOUT_MS){
          spi_manager_abort_transfer(active_jobs[index].job.spi_handle);
          if(active_jobs[index].job.notify_task != NULL &&
             active_jobs[index].job.error_flag != 0){
            osThreadFlagsSet(active_jobs[index].job.notify_task,
                             active_jobs[index].job.error_flag);
          }
          active_jobs[index].active = false;
          refresh_spi_dma_debug(active_jobs);
        }
      }
    }

    uint32_t queued_job_count = osMessageQueueGetCount(spi_job_queueHandle);
    for(uint32_t queue_index = 0; queue_index < queued_job_count; queue_index++){
      spi_job_t job;
      osStatus_t queue_status;
      queue_status = osMessageQueueGet(spi_job_queueHandle, &job, NULL, 0);
      if(queue_status != osOK) break;

      int8_t dispatch_index = get_spi_dispatch_index(job.spi_handle);
      if(dispatch_index < 0){
        if(job.notify_task != NULL && job.error_flag != 0){
          osThreadFlagsSet(job.notify_task, job.error_flag);
        }
        continue;
      }

      bool dma_resource_busy = false;
      for(uint8_t active_index = 0; active_index < 3; active_index++){
        if(active_jobs[active_index].active == false) continue;
        bool same_dma = active_jobs[active_index].job.dma_handle == job.dma_handle;
        bool rx_stream_conflict =
                active_jobs[active_index].job.rx_stream == job.rx_stream ||
                active_jobs[active_index].job.tx_stream == job.rx_stream;
        bool tx_stream_conflict =
                active_jobs[active_index].job.rx_stream == job.tx_stream ||
                active_jobs[active_index].job.tx_stream == job.tx_stream;
        if(same_dma && (rx_stream_conflict || tx_stream_conflict)){
          dma_resource_busy = true;
          break;
        }
      }

      if(active_jobs[dispatch_index].active || dma_resource_busy){
        osMessageQueuePut(spi_job_queueHandle, &job, 0, 0);
        continue;
      }

      active_jobs[dispatch_index].active = true;
      active_jobs[dispatch_index].start_tick = osKernelGetTickCount();
      active_jobs[dispatch_index].job = job;

      spi_manager_return_status transfer_status;
      transfer_status = spi_manager_transfer_dma(job.spi_handle, job.dma_handle,
                                                 job.rx_stream, job.tx_stream,
                                                 job.cs_port, job.cs_pin,
                                                 job.txdata, job.rxdata, job.size);
      if(transfer_status == _spi_manager_ok){
        refresh_spi_dma_debug(active_jobs);
        continue;
      }

      active_jobs[dispatch_index].active = false;
      if(transfer_status == _spi_manager_busy){
        osMessageQueuePut(spi_job_queueHandle, &job, 0, 0);
      }
      else if(job.notify_task != NULL && job.error_flag != 0){
        osThreadFlagsSet(job.notify_task, job.error_flag);
      }
    }
  }
  /* USER CODE END startspidmatask */
}

/* USER CODE BEGIN Header_startnrf24l01TXtask */
/**
* @brief Function implementing the nrf24l01TXtask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_startnrf24l01TXtask */
void startnrf24l01TXtask(void *argument)
{
  /* USER CODE BEGIN startnrf24l01TXtask */
  // Iki task ayni statik nRF havuzunu kullaniyor. RX init tamamen bitmeden
  // TX init baslamaz; boylece havuz indeksi uzerinde yarismalari engellenir.
  while(my_nrf_rx == NULL){
    osDelay(1);
  }

  nrf24l01_user_configs tx_cfg = {0};
  tx_cfg.spi_handle = SPI3;
  tx_cfg.dma_handle = DMA1;
  tx_cfg.rx_stream = LL_DMA_STREAM_2;
  tx_cfg.tx_stream = LL_DMA_STREAM_5;
  tx_cfg.csn_port = nrf24_csn_pin_spi3_GPIO_Port;
  tx_cfg.csn_pin = nrf24_csn_pin_spi3_Pin;
  tx_cfg.ce_port = nrf24_ce_pin_spi3_GPIO_Port;
  tx_cfg.ce_pin = nrf24_ce_pin_spi3_Pin;
  tx_cfg.spi_semaphore = spi3_semaphoreHandle;

  my_nrf_tx = nrf24l01_init(&tx_cfg);
  if(my_nrf_tx == NULL) {
    for(;;) { osDelay(1000); }
  }

  (void)spi_manager_register_validator(SPI3, validate_nrf24_spi, my_nrf_tx);

  nrf24l01_assign_interrupt_task(my_nrf_tx, nrf24l01TXtaskHandle, 0x01);
  nrf_tx_init_completed = true;
  nrf_tx_last_success_tick = osKernelGetTickCount();
  osThreadFlagsClear(0x07);

  static const uint8_t tx_iron_man[] = "enes";
  static const uint8_t tx_captain_america[] = "erbulut";
  static const uint8_t tx_hulk[] = "burada";

  static const uint8_t* const tx_messages[] = {
    tx_iron_man,
    tx_captain_america,
    tx_hulk
  };

  static const uint8_t tx_message_lengths[] = {
    sizeof(tx_iron_man) - 1,
    sizeof(tx_captain_america) - 1,
    sizeof(tx_hulk) - 1
  };

  const uint8_t tx_message_count = sizeof(tx_messages) / sizeof(tx_messages[0]);
  uint8_t tx_message_index = 0;

  /* Infinite loop */
  for(;;)
  {
    system_health_heartbeat(HEALTH_TASK_NRF_TX);
    const uint8_t* tx_message = tx_messages[tx_message_index];
    uint8_t tx_message_length = tx_message_lengths[tx_message_index];

    spi_job_t job;
    nrf24l01_return_status nrf_status;
    nrf_status = nrf24l01_build_tx_job(my_nrf_tx, tx_message, tx_message_length,
                                      nrf24l01TXtaskHandle, 0x02, 0x04, &job);
    if(nrf_status != _nrf24l01_ok)
    {
      flush_tx(my_nrf_tx);
      nrf_tx_error_count++;
      osDelay(1000);
      continue;
    }

    osStatus_t queue_status;
    queue_status = submit_spi_dma_job(&job);
    if(queue_status != osOK)
    {
      flush_tx(my_nrf_tx);
      nrf_tx_error_count++;
      osDelay(1000);
      continue;
    }

    uint32_t dma_flags = osThreadFlagsWait(0x06, osFlagsWaitAny, 500);
    bool dma_wait_error = (dma_flags & osFlagsError) != 0;
    bool dma_finished = (dma_flags & 0x02) != 0;
    if(dma_wait_error || dma_finished == false)
    {
      flush_tx(my_nrf_tx);
      nrf_tx_error_count++;
      osDelay(1000);
      continue;
    }

    osThreadFlagsClear(0x01);
    nrf_status = nrf24l01_trigger_transmission(my_nrf_tx);
    if(nrf_status != _nrf24l01_ok)
    {
      flush_tx(my_nrf_tx);
      nrf_tx_error_count++;
      osDelay(1000);
      continue;
    }

    uint32_t irq_flags = osThreadFlagsWait(0x01, osFlagsWaitAny, 200);
    bool irq_wait_error = (irq_flags & osFlagsError) != 0;
    bool irq_arrived = (irq_flags & 0x01) != 0;
    if(irq_wait_error || irq_arrived == false)
    {
      nrf24l01_clear_interrupts(my_nrf_tx);
      flush_tx(my_nrf_tx);
      nrf_tx_error_count++;
      osDelay(1000);
      continue;
    }

    nrf24l01_irq_status_t irq_status;
    nrf_status = nrf24l01_get_irq_status(my_nrf_tx, &irq_status);
    if(nrf_status != _nrf24l01_ok)
    {
      flush_tx(my_nrf_tx);
      nrf_tx_error_count++;
      osDelay(1000);
      continue;
    }

    nrf24l01_clear_irq_sources(my_nrf_tx, irq_status.raw);
    if(irq_status.tx_ds){
      nrf_tx_success_count++;
      nrf_tx_last_success_tick = osKernelGetTickCount();

      osStatus_t mutex_status;
      mutex_status = osMutexAcquire(sensor_data_mutexHandle, 10);
      if(mutex_status == osOK){
        copy_display_text(nrf24l01_display_data.tx_text,
                sizeof(nrf24l01_display_data.tx_text), tx_message,
                tx_message_length);
        nrf24l01_display_data.tx_length = tx_message_length;
        nrf24l01_display_data.tx_valid = true;
        nrf24l01_display_data.tx_update_count++;
        osMutexRelease(sensor_data_mutexHandle);
      }

