mechacoredev/stm32f4-freertos-multi-device-hub/Core/Src/main.c
      tx_message_index++;
      if(tx_message_index >= tx_message_count){
        tx_message_index = 0;
      }
    }
    else if(irq_status.max_rt){
      flush_tx(my_nrf_tx);
      nrf_tx_error_count++;
    }

    osDelay(1000);
  }
  /* USER CODE END startnrf24l01TXtask */
}

/* USER CODE BEGIN Header_startnrf24l01RXtask */
/**
* @brief Function implementing the nrf24l01RXtask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_startnrf24l01RXtask */
void startnrf24l01RXtask(void *argument)
{
  /* USER CODE BEGIN startnrf24l01RXtask */
  nrf24l01_user_configs rx_cfg = {0};
  rx_cfg.spi_handle = SPI1;
  rx_cfg.dma_handle = DMA2;
  rx_cfg.rx_stream = LL_DMA_STREAM_0;
  rx_cfg.tx_stream = LL_DMA_STREAM_3;
  rx_cfg.csn_port = nrf24_csn_pin_spi1_GPIO_Port;
  rx_cfg.csn_pin = nrf24_csn_pin_spi1_Pin;
  rx_cfg.ce_port = nrf24_ce_pin_spi1_GPIO_Port;
  rx_cfg.ce_pin = nrf24_ce_pin_spi1_Pin;
  rx_cfg.spi_semaphore = spi_semaphoreHandle;

  my_nrf_rx = nrf24l01_init(&rx_cfg);
  if(my_nrf_rx == NULL) {
    for(;;) { osDelay(1000); }
  }

  (void)spi_manager_register_validator(SPI1, validate_nrf24_spi, my_nrf_rx);

  nrf24l01_assign_interrupt_task(my_nrf_rx, nrf24l01RXtaskHandle, 0x01);
  osThreadFlagsClear(0x07);
  nrf24l01_clear_interrupts(my_nrf_rx);
  nrf24l01_start_listening(my_nrf_rx);
  nrf_rx_init_completed = true;
  nrf_rx_last_success_tick = osKernelGetTickCount();

  /* Infinite loop */
  for(;;)
  {
    system_health_heartbeat(HEALTH_TASK_NRF_RX);
    uint32_t flags = osThreadFlagsWait(0x01, osFlagsWaitAny, 1000);
    bool flag_wait_error = (flags & osFlagsError) != 0;
    bool interrupt_arrived = (flags & 0x01) != 0;
    if(flag_wait_error || interrupt_arrived == false) continue;

    nrf24l01_irq_status_t irq_status = {0};
    nrf24l01_return_status nrf_status;
    nrf_status = nrf24l01_get_irq_status(my_nrf_rx, &irq_status);
    if(nrf_status != _nrf24l01_ok) continue;

    if(irq_status.rx_dr == false)
    {
      nrf24l01_clear_irq_sources(my_nrf_rx, irq_status.raw);
      continue;
    }

    uint8_t packets_read_this_interrupt = 0;
    nrf24l01_fifo_status_t fifo_status;
    nrf_status = nrf24l01_get_fifo_status(my_nrf_rx, &fifo_status);
    if(nrf_status != _nrf24l01_ok) continue;

    // nRF24L01 ayri bir FIFO-full interrupt'i uretmez.
    // RX_DR geldikten sonra RX_FULL biti, FIFO'nun 3 paket dolu oldugunu gosterir.
    nrf_rx_fifo_was_full = fifo_status.rx_full;

    // FIFO doluysa 3 paket; dolu degilse o anda bulunan 1 veya 2 paket okunur.
    while(fifo_status.rx_empty == false &&
          packets_read_this_interrupt < NRF24L01_FIFO_DEPTH)
    {
      spi_job_t job;
      uint8_t payload_length = 0;
      nrf_status = nrf24l01_build_rx_fifo_job(my_nrf_rx, nrf24l01RXtaskHandle,
                                              0x02, 0x04, &payload_length, &job);
      if(nrf_status != _nrf24l01_ok) break;

      osStatus_t queue_status;
      queue_status = submit_spi_dma_job(&job);
      if(queue_status != osOK) break;

      uint32_t dma_flags = osThreadFlagsWait(0x06, osFlagsWaitAny, 500);
      bool dma_wait_error = (dma_flags & osFlagsError) != 0;
      bool dma_finished = (dma_flags & 0x02) != 0;
      if(dma_wait_error || dma_finished == false) break;

      uint8_t storage_index = nrf_rx_debug_write_index;
      memset(nrf_rx_fifo[storage_index], 0, NRF24L01_PAYLOAD_SIZE);
      nrf_status = nrf24l01_finish_rx_fifo_job(my_nrf_rx,
                                               nrf_rx_fifo[storage_index],
                                               payload_length);
      if(nrf_status != _nrf24l01_ok) break;

      nrf_rx_payload_lengths[storage_index] = payload_length;

      osStatus_t mutex_status;
      mutex_status = osMutexAcquire(sensor_data_mutexHandle, 10);
      if(mutex_status == osOK){
        copy_display_text(nrf24l01_display_data.rx_text,
                sizeof(nrf24l01_display_data.rx_text),
                nrf_rx_fifo[storage_index], payload_length);
        nrf24l01_display_data.rx_length = payload_length;
        nrf24l01_display_data.rx_valid = true;
        nrf24l01_display_data.rx_update_count++;
        osMutexRelease(sensor_data_mutexHandle);
      }

      nrf_rx_debug_write_index++;
      if(nrf_rx_debug_write_index >= NRF24L01_FIFO_DEPTH){
        nrf_rx_debug_write_index = 0;
      }

      if(nrf_rx_fifo_count < NRF24L01_FIFO_DEPTH){
        nrf_rx_fifo_count++;
      }

      packets_read_this_interrupt++;
      nrf_rx_packet_count++;
      nrf_rx_last_success_tick = osKernelGetTickCount();
      sayac++;

      // Datasheet sirasi: payload oku, RX_DR temizle, FIFO_STATUS kontrol et.
      nrf24l01_clear_irq_sources(my_nrf_rx, NRF24L01_IRQ_RX_DR);
      nrf_status = nrf24l01_get_fifo_status(my_nrf_rx, &fifo_status);
      if(nrf_status != _nrf24l01_ok) break;
    }

    // Okuma sirasinda yeni paket geldiyse kalan FIFO'yu sonraki turda bosalt.
    nrf_status = nrf24l01_get_fifo_status(my_nrf_rx, &fifo_status);
    if(nrf_status == _nrf24l01_ok && fifo_status.rx_empty == false){
      osThreadFlagsSet(nrf24l01RXtaskHandle, 0x01);
    }
  }
  /* USER CODE END startnrf24l01RXtask */
}

/* USER CODE BEGIN Header_startili9341task */
/**
* @brief Function implementing the ili9341task thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_startili9341task */
void startili9341task(void *argument)
{
  /* USER CODE BEGIN startili9341task */
  while(bme280_init_completed == false ||
        mpu6050_init_completed == false){
    osDelay(10);
  }

  ili9341_user_configs tft1_cfg = {0};
  tft1_cfg.spi_handle = SPI3;
  tft1_cfg.dma_handle = DMA1;
  tft1_cfg.dma_tx_stream = LL_DMA_STREAM_5;
  tft1_cfg.dma_rx_stream = LL_DMA_STREAM_2;
  tft1_cfg.cs_port = TFT1_CS_GPIO_Port;
  tft1_cfg.cs_pin = TFT1_CS_Pin;
  tft1_cfg.dc_port = TFT1_DC_GPIO_Port;
  tft1_cfg.dc_pin = TFT1_DC_Pin;
  tft1_cfg.rst_port = TFT1_RST_GPIO_Port;
  tft1_cfg.rst_pin = TFT1_RST_Pin;
  tft1_cfg.rotation = ILI9341_ROTATION_90;

  ili9341_user_configs tft2_cfg = {0};
  tft2_cfg.spi_handle = SPI3;
  tft2_cfg.dma_handle = DMA1;
  tft2_cfg.dma_tx_stream = LL_DMA_STREAM_5;
  tft2_cfg.dma_rx_stream = LL_DMA_STREAM_2;
  tft2_cfg.cs_port = TFT2_CS_GPIO_Port;
  tft2_cfg.cs_pin = TFT2_CS_Pin;
  tft2_cfg.dc_port = TFT2_DC_GPIO_Port;
  tft2_cfg.dc_pin = TFT2_DC_Pin;
  tft2_cfg.rst_port = TFT2_RST_GPIO_Port;
  tft2_cfg.rst_pin = TFT2_RST_Pin;
  tft2_cfg.rotation = ILI9341_ROTATION_90;

  my_tft1 = ili9341_init(&tft1_cfg);
  my_tft2 = ili9341_init(&tft2_cfg);

  if(my_tft1 == NULL || my_tft2 == NULL){
    ili9341_last_status = _ili9341_fail;
    ili9341_test_passed = false;
    for(;;){
      osDelay(1000);
    }
  }
  ili9341_init_completed = true;
  ili9341_last_success_tick = osKernelGetTickCount();

  ili9341_last_status = ili9341_begin_fill_rect(my_tft1, 0, 0,
          ili9341_get_width(my_tft1), ili9341_get_height(my_tft1),
          ILI9341_COLOR_BLACK);
  if(ili9341_last_status == _ili9341_ok){
    ili9341_last_status = run_ili9341_dma_operation(my_tft1);
  }

  if(ili9341_last_status == _ili9341_ok){
    ili9341_last_status = ili9341_begin_fill_rect(my_tft2, 0, 0,
            ili9341_get_width(my_tft2), ili9341_get_height(my_tft2),
            ILI9341_COLOR_BLACK);
  }
  if(ili9341_last_status == _ili9341_ok){
    ili9341_last_status = run_ili9341_dma_operation(my_tft2);
  }

  if(ili9341_last_status == _ili9341_ok){
    ili9341_last_status = draw_sensor_display_layout();
  }

