mechacoredev/stm32f4-freertos-multi-device-hub/Core/Src/main.c
  ili9341_test_passed = ili9341_last_status == _ili9341_ok;
  uint32_t last_bme280_update_count = 0;
  uint32_t last_mpu6050_update_count = 0;
  uint32_t last_nrf_tx_update_count = 0;
  uint32_t last_nrf_rx_update_count = 0;
  uint32_t last_rc522_update_count = 0;
  uint32_t next_sensor_display_tick = osKernelGetTickCount();

  /* Infinite loop */
  for(;;)
  {
    system_health_heartbeat(HEALTH_TASK_DISPLAY);
    // DMA aktarimlari zaten taski uyutarak bekletiyor. Bu kisa gecikme,
    // yeni snapshot yokken ekran taskinin bosuna donmesini engelliyor.
    osDelay(10);

    bme280_display_data_t bme_snapshot = {0};
    mpu6050_display_data_t mpu_snapshot = {0};
    nrf24l01_display_data_t nrf_snapshot = {0};
    rc522_display_data_t rc522_snapshot = {0};
    osStatus_t mutex_status;
    mutex_status = osMutexAcquire(sensor_data_mutexHandle, 20);
    if(mutex_status == osOK){
      bme_snapshot = bme280_display_data;
      mpu_snapshot = mpu6050_display_data;
      nrf_snapshot = nrf24l01_display_data;
      rc522_snapshot = rc522_display_data;
      osMutexRelease(sensor_data_mutexHandle);
    }

    uint32_t now = osKernelGetTickCount();
    bool sensor_refresh_due = (int32_t)(now - next_sensor_display_tick) >= 0;
    if(sensor_refresh_due){
      next_sensor_display_tick = now + 100;
    }

    if(sensor_refresh_due && bme_snapshot.valid &&
       bme_snapshot.update_count != last_bme280_update_count){
      ili9341_return_status display_status;
      display_status = refresh_bme280_display(&bme_snapshot);
      if(display_status == _ili9341_ok){
        last_bme280_update_count = bme_snapshot.update_count;
      }
      else{
        ili9341_last_status = display_status;
      }
    }

    if(sensor_refresh_due && mpu_snapshot.valid &&
       mpu_snapshot.update_count != last_mpu6050_update_count){
      ili9341_return_status display_status;
      display_status = refresh_mpu6050_display(&mpu_snapshot);
      if(display_status == _ili9341_ok){
        last_mpu6050_update_count = mpu_snapshot.update_count;
      }
      else{
        ili9341_last_status = display_status;
      }
    }

    if(nrf_snapshot.tx_valid &&
       nrf_snapshot.tx_update_count != last_nrf_tx_update_count){
      ili9341_return_status display_status;
      display_status = refresh_nrf_tx_display(&nrf_snapshot);
      if(display_status == _ili9341_ok){
        last_nrf_tx_update_count = nrf_snapshot.tx_update_count;
      }
      else{
        ili9341_last_status = display_status;
      }
    }

    if(nrf_snapshot.rx_valid &&
       nrf_snapshot.rx_update_count != last_nrf_rx_update_count){
      ili9341_return_status display_status;
      display_status = refresh_nrf_rx_display(&nrf_snapshot);
      if(display_status == _ili9341_ok){
        last_nrf_rx_update_count = nrf_snapshot.rx_update_count;
      }
      else{
        ili9341_last_status = display_status;
      }
    }

    if(rc522_snapshot.update_count != last_rc522_update_count){
      ili9341_return_status display_status;
      display_status = refresh_rc522_display(&rc522_snapshot);
      if(display_status == _ili9341_ok){
        last_rc522_update_count = rc522_snapshot.update_count;
      }
      else{
        ili9341_last_status = display_status;
      }
    }

    ili9341_test_passed = ili9341_last_status == _ili9341_ok;
  }
  /* USER CODE END startili9341task */
}

static bool recover_supervised_bus(system_health_bus_id_t bus){
  if(bus == SYSTEM_BUS_I2C1){
    /* Aktif DMA/polling transferini health tasktan zorla bozma. Manager mutexi
     * recovery ile dispatcher'i siraya sokar; mesgulse sonraki turda denenir. */
    return i2c_manager_recover_bus(I2C1) == _i2c_manager_ok;
  }
  if(bus == SYSTEM_BUS_SPI1){
    return spi_manager_recover_bus(SPI1) == _spi_manager_ok;
  }
  if(bus == SYSTEM_BUS_SPI2){
    return spi_manager_recover_bus(SPI2) == _spi_manager_ok;
  }
  if(bus == SYSTEM_BUS_SPI3){
    return spi_manager_recover_bus(SPI3) == _spi_manager_ok;
  }
  if(bus == SYSTEM_BUS_CAN2){
    return can_manager_recover(CAN2) == can_manager_ok;
  }
  return false;
}

static void supervise_faulted_buses(uint32_t now){
  for(uint32_t index = 0; index < SYSTEM_BUS_COUNT; index++){
    volatile system_health_bus_diagnostics_t *health = &g_system_bus_health[index];
    if(health->state == SYSTEM_BUS_STATE_OK) continue;

    if((now - health->last_recovery_tick) >= BUS_RECOVERY_RETRY_PERIOD_MS){
      system_health_bus_mark_recovering((system_health_bus_id_t)index);
      bool recovered = recover_supervised_bus((system_health_bus_id_t)index);
      int32_t recovery_status = -1;
      if(recovered) recovery_status = 0;
      system_health_bus_record_recovery((system_health_bus_id_t)index,
              recovered, recovery_status);
    }

    if((health->fault_since_tick != 0) &&
       ((now - health->fault_since_tick) >= BUS_RECOVERY_RESET_TIMEOUT_MS)){
      health->reset_deadline_expired = true;
      if(is_mcu_reset_allowed){
        __DSB();
        NVIC_SystemReset();
      }else{
        health->reset_suppressed = true;
      }
    }
  }
}

/* USER CODE BEGIN Header_starthealthtask */
/**
* @brief Function implementing the healthtask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_starthealthtask */
void starthealthtask(void *argument)
{
  /* USER CODE BEGIN starthealthtask */
  (void)argument;

  /* Donanimsal watchdog hemen baslatilir. Baslangic izni watchdog'u kapali
   * tutmaz; yalnizca cevre birimleri kurulurken sinirli sure beslenmesini
   * saglar. Boylece her resetten sonra korunmasiz 15 saniyelik pencere kalmaz. */
  const uint32_t monitor_period_ms = 1000;
  uint32_t startup_tick = osKernelGetTickCount();
  uint32_t next_check = osKernelGetTickCount();
  bool watchdog_ready = system_health_watchdog_start();
  uint32_t observed_bme_tick = 0;
  uint32_t observed_mpu_tick = 0;
  uint32_t observed_rc522_tick = 0;
  uint32_t observed_nrf_tx_tick = 0;
  uint32_t observed_nrf_rx_tick = 0;
  uint32_t observed_display_tick = 0;
  uint32_t observed_can_tx_count = 0;
  uint32_t observed_can_rx_count = 0;
  uint32_t observed_can_error_count = 0;

  for(;;)
  {
    next_check += monitor_period_ms;
    osDelayUntil(next_check);

    uint32_t now = osKernelGetTickCount();
    bool all_tasks_healthy = system_health_evaluate_window(
            ACTIVE_HEALTH_MASK);

    if(bme280_last_success_tick != observed_bme_tick){
      observed_bme_tick = bme280_last_success_tick;
      system_health_bus_record_success(SYSTEM_BUS_I2C1,
              SYSTEM_SOURCE_BME280, SYSTEM_OPERATION_READ, 0x76, 0);
    }
    if(mpu6050_last_success_tick != observed_mpu_tick){
      observed_mpu_tick = mpu6050_last_success_tick;
      system_health_bus_record_success(SYSTEM_BUS_I2C1,
              SYSTEM_SOURCE_MPU6500, SYSTEM_OPERATION_READ, 0x68, 0);
    }
    if(!REDUCED_I2C_CAN_TEST &&
       rc522_last_liveness_tick != observed_rc522_tick){
      observed_rc522_tick = rc522_last_liveness_tick;
      system_health_bus_record_success(SYSTEM_BUS_SPI1,
              SYSTEM_SOURCE_RC522, SYSTEM_OPERATION_TRANSFER, 0, 0);
    }
    if(!REDUCED_I2C_CAN_TEST &&
       nrf_tx_last_success_tick != observed_nrf_tx_tick){
      observed_nrf_tx_tick = nrf_tx_last_success_tick;
      system_health_bus_record_success(SYSTEM_BUS_SPI3,
              SYSTEM_SOURCE_NRF24_TX, SYSTEM_OPERATION_WRITE, 0, 0);
    }
    if(!REDUCED_I2C_CAN_TEST &&
       nrf_rx_last_success_tick != observed_nrf_rx_tick){
      observed_nrf_rx_tick = nrf_rx_last_success_tick;
      system_health_bus_record_success(SYSTEM_BUS_SPI1,
              SYSTEM_SOURCE_NRF24_RX, SYSTEM_OPERATION_READ, 0, 0);
    }
    if(!REDUCED_I2C_CAN_TEST &&
       ili9341_last_success_tick != observed_display_tick){
      observed_display_tick = ili9341_last_success_tick;
      system_health_bus_record_success(SYSTEM_BUS_SPI3,
              SYSTEM_SOURCE_ILI9341, SYSTEM_OPERATION_WRITE, 0, 0);
    }
    if(g_can2_debug.tx_complete_count != observed_can_tx_count){
      observed_can_tx_count = g_can2_debug.tx_complete_count;
      system_health_bus_record_success(SYSTEM_BUS_CAN2,
              SYSTEM_SOURCE_CAN_TX, SYSTEM_OPERATION_WRITE,
              g_can2_last_tx_frame.id, g_can2_last_tx_frame.dlc);
    }
    if(g_can2_debug.rx_received_count != observed_can_rx_count){
      observed_can_rx_count = g_can2_debug.rx_received_count;
      uint32_t received_id = 0;
      if(g_can2_last_rx_frame_ptr != NULL){
        received_id = g_can2_last_rx_frame_ptr->id;
      }
      system_health_bus_record_success(SYSTEM_BUS_CAN2,
              SYSTEM_SOURCE_CAN_RX, SYSTEM_OPERATION_READ, received_id, 0);
    }
    (void)can_manager_check_ack_timeout(CAN2, CAN_ACK_TIMEOUT_MS);
    uint32_t can_error_count = g_can2_debug.tx_error_count +
            g_can2_debug.error_irq_count + g_can2_debug.bus_off_count +
            g_can2_debug.ack_timeout_count;
    if(can_error_count != observed_can_error_count){
      observed_can_error_count = can_error_count;
      system_health_bus_record_failure(SYSTEM_BUS_CAN2,
              (int32_t)g_can2_debug.last_status);
    }

