mechacoredev/stm32f4-freertos-multi-device-hub/Core/Src/main.c
    uint32_t stale_mask = 0;
    if(bme280_init_completed &&
       (now - bme280_last_success_tick) >= SENSOR_DATA_STALE_TIMEOUT_MS){
      stale_mask |= SENSOR_STALE_BME280_MASK;
    }
    if(mpu6050_init_completed &&
       (now - mpu6050_last_success_tick) >= SENSOR_DATA_STALE_TIMEOUT_MS){
      stale_mask |= SENSOR_STALE_MPU6050_MASK;
    }
    if(!REDUCED_I2C_CAN_TEST && rc522_init_completed &&
       (now - rc522_last_liveness_tick) >=
               RC522_LIVENESS_STALE_TIMEOUT_MS){
      stale_mask |= SPI_STALE_RC522_MASK;
    }
    if(!REDUCED_I2C_CAN_TEST && nrf_tx_init_completed &&
       (now - nrf_tx_last_success_tick) >= NRF_PROGRESS_STALE_TIMEOUT_MS){
      stale_mask |= SPI_STALE_NRF_TX_MASK;
    }
    if(!REDUCED_I2C_CAN_TEST && nrf_rx_init_completed &&
       (now - nrf_rx_last_success_tick) >= NRF_PROGRESS_STALE_TIMEOUT_MS){
      stale_mask |= SPI_STALE_NRF_RX_MASK;
    }
    if(!REDUCED_I2C_CAN_TEST && ili9341_init_completed &&
       (now - ili9341_last_success_tick) >=
               DISPLAY_PROGRESS_STALE_TIMEOUT_MS){
      stale_mask |= SPI_STALE_DISPLAY_MASK;
    }
    sensor_data_stale_mask = stale_mask;
    subsystem_stale_mask = stale_mask;

    bool startup_grace_elapsed =
            (now - startup_tick) >= WATCHDOG_STARTUP_GRACE_MS;
    if(startup_grace_elapsed){
      if((!bme280_init_completed || !mpu6050_init_completed) &&
         (g_system_bus_health[SYSTEM_BUS_I2C1].state == SYSTEM_BUS_STATE_OK)){
        system_health_bus_record_failure(SYSTEM_BUS_I2C1,
                (int32_t)i2c_manager_last_result(I2C1));
      }

      if(!REDUCED_I2C_CAN_TEST &&
         (!rc522_init_completed || !nrf_rx_init_completed) &&
         (g_system_bus_health[SYSTEM_BUS_SPI1].state == SYSTEM_BUS_STATE_OK)){
        system_health_bus_record_failure(SYSTEM_BUS_SPI1,
                _spi_manager_uninited_struct);
      }

      if(!REDUCED_I2C_CAN_TEST && !ili9341_init_completed &&
         (g_system_bus_health[SYSTEM_BUS_SPI3].state == SYSTEM_BUS_STATE_OK)){
        system_health_bus_record_failure(SYSTEM_BUS_SPI3,
                _spi_manager_uninited_struct);
      }

      if(!REDUCED_I2C_CAN_TEST && !nrf_tx_init_completed &&
         (g_system_bus_health[SYSTEM_BUS_SPI3].state == SYSTEM_BUS_STATE_OK)){
        system_health_bus_record_failure(SYSTEM_BUS_SPI3,
                _spi_manager_uninited_struct);
      }

      if((g_can2_debug.initialized == 0) &&
         (g_system_bus_health[SYSTEM_BUS_CAN2].state == SYSTEM_BUS_STATE_OK)){
        system_health_bus_record_failure(SYSTEM_BUS_CAN2,
                can_manager_not_initialized);
      }
    }

    if((stale_mask & (SENSOR_STALE_BME280_MASK |
            SENSOR_STALE_MPU6050_MASK)) != 0){
      if(g_system_bus_health[SYSTEM_BUS_I2C1].state == SYSTEM_BUS_STATE_OK){
        system_health_bus_record_failure(SYSTEM_BUS_I2C1,
                (int32_t)i2c_manager_last_result(I2C1));
      }
    }
    if((stale_mask & (SPI_STALE_RC522_MASK | SPI_STALE_NRF_RX_MASK)) != 0){
      if(g_system_bus_health[SYSTEM_BUS_SPI1].state == SYSTEM_BUS_STATE_OK){
        system_health_bus_record_failure(SYSTEM_BUS_SPI1, _spi_manager_timeout);
      }
    }
    if((stale_mask & SPI_STALE_DISPLAY_MASK) != 0){
      if(g_system_bus_health[SYSTEM_BUS_SPI3].state == SYSTEM_BUS_STATE_OK){
        system_health_bus_record_failure(SYSTEM_BUS_SPI3, _spi_manager_timeout);
      }
    }
    if((stale_mask & SPI_STALE_NRF_TX_MASK) != 0){
      if(g_system_bus_health[SYSTEM_BUS_SPI3].state == SYSTEM_BUS_STATE_OK){
        system_health_bus_record_failure(SYSTEM_BUS_SPI3, _spi_manager_timeout);
      }
    }

    system_health_bus_refresh_ages(now);
    supervise_faulted_buses(now);
    bool subsystems_initialized = bme280_init_completed &&
            mpu6050_init_completed && (g_can2_debug.initialized != 0);
#if !REDUCED_I2C_CAN_TEST
    subsystems_initialized = subsystems_initialized &&
            rc522_init_completed && nrf_tx_init_completed &&
            nrf_rx_init_completed && ili9341_init_completed;
#endif
    if(!health_normal_monitoring_started && subsystems_initialized &&
       all_tasks_healthy && stale_mask == 0){
      health_normal_monitoring_started = true;
    }

    health_startup_grace_active = !health_normal_monitoring_started &&
            (now - startup_tick) < WATCHDOG_STARTUP_GRACE_MS;
    bool bus_fault_active = false;
    uint32_t tolerated_missing_heartbeat_mask = 0;
    for(uint32_t index = 0; index < SYSTEM_BUS_COUNT; index++){
      if(g_system_bus_health[index].state != SYSTEM_BUS_STATE_OK){
        bus_fault_active = true;

        if(index == SYSTEM_BUS_I2C1){
          tolerated_missing_heartbeat_mask |=
                  SYSTEM_HEALTH_TASK_MASK(HEALTH_TASK_BME280) |
                  SYSTEM_HEALTH_TASK_MASK(HEALTH_TASK_MPU6050);
        }
        if(index == SYSTEM_BUS_SPI1){
          tolerated_missing_heartbeat_mask |=
                  SYSTEM_HEALTH_TASK_MASK(HEALTH_TASK_RC522) |
                  SYSTEM_HEALTH_TASK_MASK(HEALTH_TASK_NRF_RX);
        }
        if(index == SYSTEM_BUS_SPI3){
          tolerated_missing_heartbeat_mask |=
                  SYSTEM_HEALTH_TASK_MASK(HEALTH_TASK_NRF_TX) |
                  SYSTEM_HEALTH_TASK_MASK(HEALTH_TASK_DISPLAY);
        }
        if(index == SYSTEM_BUS_CAN2){
          tolerated_missing_heartbeat_mask |=
                  SYSTEM_HEALTH_TASK_MASK(HEALTH_TASK_CAN_RX) |
                  SYSTEM_HEALTH_TASK_MASK(HEALTH_TASK_CAN_TX);
        }
      }
    }

    uint32_t unexpected_missing_heartbeat_mask =
            g_system_health.missing_heartbeat_mask &
            ~tolerated_missing_heartbeat_mask;
    bool recovery_window_healthy = bus_fault_active &&
            (unexpected_missing_heartbeat_mask == 0);

    if(health_normal_monitoring_started){
      health_watchdog_feed_allowed = all_tasks_healthy ||
              recovery_window_healthy;
    }else{
      health_watchdog_feed_allowed = health_startup_grace_active ||
              recovery_window_healthy;
    }

    if(!watchdog_ready){
      watchdog_ready = system_health_watchdog_start();
    }
    if(watchdog_ready && health_watchdog_feed_allowed){
      system_health_watchdog_feed();
    }
    refresh_runtime_debug(now, stale_mask);
    /* When a heartbeat is missing, this task deliberately stops feeding the
     * watchdog. The IWDG then resets a system that can no longer self-recover. */
  }
  /* USER CODE END starthealthtask */
}

