mechacoredev/stm32f4-freertos-multi-device-hub/Core/Src/main.c
/* USER CODE BEGIN Header_StartCAN2ReadTask */
/**
* @brief Function implementing the CAN2ReadTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartCAN2ReadTask */
void StartCAN2ReadTask(void *argument)
{
  /* USER CODE BEGIN StartCAN2ReadTask */
  (void)argument;

  can_manager_status_t init_status;

  do
  {
    init_status = can_manager_init(CAN2, CAN2ReadTaskHandle, CAN2WriteTaskHandle);
    if(init_status != can_manager_ok) osDelay(100);
  }
  while(init_status != can_manager_ok);

  for(;;)
  {
    system_health_heartbeat(HEALTH_TASK_CAN_RX);
    uint32_t flags = osThreadFlagsWait(CAN_MANAGER_RX_EVENT_ANY, osFlagsWaitAny, 500);

    if((flags & osFlagsError) != 0) continue;

    if((flags & CAN_MANAGER_RX_EVENT_ERROR) != 0) can_manager_refresh_debug(CAN2);

    const can_frame_t* received_frame;
    while((received_frame = can_manager_rx_peek(CAN2)) != NULL)
    {
      /* received_frame gercek ring-buffer hucresidir; burada ikinci bir frame kopyasi olusturulmaz. */
        if(received_frame->id == 0x103)
        {
            /* received_frame->data burada işlenir. */
        }
      (void)can_manager_rx_release(CAN2);
    }
  }
  /* USER CODE END StartCAN2ReadTask */
}

/* USER CODE BEGIN Header_StartCAN2WriteTask */
/**
* @brief Function implementing the CAN2WriteTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartCAN2WriteTask */
void StartCAN2WriteTask(void *argument)
{
  /* USER CODE BEGIN StartCAN2WriteTask */
  (void)argument;

  can_frame_t test_frame = {
    .id = 0x407U,
    .dlc = 7U,
    .extended_id = false,
    .remote_frame = false,
    .data = {'F', '4', '0', '7', 'C', 'A', 'N', 0U},
    .timestamp = 0U
  };

  (void)osThreadFlagsWait(CAN_MANAGER_TX_EVENT_READY, osFlagsWaitAny, osWaitForever);
  uint32_t next_transmit_tick = osKernelGetTickCount();

  for(;;)
  {
    system_health_heartbeat(HEALTH_TASK_CAN_TX);
    next_transmit_tick += 1000;
    osDelayUntil(next_transmit_tick);

    can_manager_status_t send_status = can_manager_send(CAN2, &test_frame);
    if(send_status == can_manager_no_tx_mailbox)
    {
      (void)osThreadFlagsWait(CAN_MANAGER_TX_EVENT_ANY, osFlagsWaitAny, 100);
      (void)can_manager_send(CAN2, &test_frame);
    }
  }
  /* USER CODE END StartCAN2WriteTask */
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6)
  {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
